
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AkAudio
/// dependency: AnimationBudgetAllocator
/// dependency: AnimationUtilities
/// dependency: AnimGraphRuntime
/// dependency: Archives
/// dependency: Audio
/// dependency: Blueprints
/// dependency: CoreUObject
/// dependency: Customization
/// dependency: DBDAnalytics
/// dependency: DBDAnimation
/// dependency: DBDAnimationBudgetAllocator
/// dependency: DBDAttack
/// dependency: DBDGameplay
/// dependency: DBDInteraction
/// dependency: DBDSharedTypes
/// dependency: DeadByDaylight
/// dependency: Effects
/// dependency: Engine
/// dependency: GFXUtilities
/// dependency: Niagara
/// dependency: SignificanceUtilities
/// dependency: TheK26
/// dependency: TheK28
/// dependency: TheK31
/// dependency: TheOni
/// dependency: TheOnryo
/// dependency: TheSpirit

/// Enum /Game/Characters/Campers/Common/Enum_CamperMenuAnimationState.Enum_CamperMenuAnimationState
/// Size: 0x06
enum class Enum_CamperMenuAnimationState : uint8_t
{
	Enum_CamperMenuAnimationState__NewEnumerator5                                    = 0,
	Enum_CamperMenuAnimationState__NewEnumerator0                                    = 1,
	Enum_CamperMenuAnimationState__NewEnumerator2                                    = 2,
	Enum_CamperMenuAnimationState__NewEnumerator3                                    = 3,
	Enum_CamperMenuAnimationState__NewEnumerator4                                    = 4,
	Enum_CamperMenuAnimationState__Enum_MAX                                          = 5
};

/// Enum /Game/Characters/Slashers/Animations/MenuAnimationSync/Enum_MenuAnimationState.Enum_MenuAnimationState
/// Size: 0x08
enum class Enum_MenuAnimationState : uint8_t
{
	Enum_MenuAnimationState__NewEnumerator6                                          = 0,
	Enum_MenuAnimationState__NewEnumerator1                                          = 1,
	Enum_MenuAnimationState__NewEnumerator5                                          = 2,
	Enum_MenuAnimationState__NewEnumerator0                                          = 3,
	Enum_MenuAnimationState__NewEnumerator2                                          = 4,
	Enum_MenuAnimationState__NewEnumerator3                                          = 5,
	Enum_MenuAnimationState__NewEnumerator4                                          = 6,
	Enum_MenuAnimationState__Enum_MAX                                                = 7
};

/// Enum /Game/Meshes/Charms/Blueprints/Survivor_Chains/enum_charmsJointChains.Enum_CharmsJointChains
/// Size: 0x04
enum class Enum_CharmsJointChains : uint8_t
{
	Enum_CharmsJointChains__NewEnumerator0                                           = 0,
	Enum_CharmsJointChains__NewEnumerator1                                           = 1,
	Enum_CharmsJointChains__NewEnumerator2                                           = 2,
	Enum_CharmsJointChains__Enum_MAX                                                 = 3
};

/// Enum /Game/Meshes/Charms/Blueprints/Survivor_Chains/enum_charmsJointAttachment.Enum_CharmsJointAttachment
/// Size: 0x04
enum class Enum_CharmsJointAttachment : uint8_t
{
	Enum_CharmsJointAttachment__NewEnumerator0                                       = 0,
	Enum_CharmsJointAttachment__NewEnumerator1                                       = 1,
	Enum_CharmsJointAttachment__NewEnumerator2                                       = 2,
	Enum_CharmsJointAttachment__Enum_MAX                                             = 3
};

/// Struct /Game/Characters/Campers/Common/Aset_Camper_Menu.Aset_Camper_Menu
/// Size: 0x0058 (0x000000 - 0x000058)
struct FAset_Camper_Menu
{ 
	int32_t                                            IdleInterruptQuantity_35_3BE7C7644CFA1ADF9841D5BE4D3A7FED;  // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UAnimSequence*                               StartIdle_38_63B094F54B84DD4138ED97B63A87B394;              // 0x0008   (0x0008)  
	class UAnimSequence*                               MenuIdle_18_FFD6BA49453CFEA6D8A893B6109C431F;               // 0x0010   (0x0008)  
	class UAnimSequence*                               MenuIdleWithItem_48_C5D4193A40F4174BB499D9AA87161F98;       // 0x0018   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt01_19_31F0358C4D2070DFC9142F820362D54F;    // 0x0020   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt02_22_0519AE00431F80436F2653995DB3AF63;    // 0x0028   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt03_31_C1F95CFA4C45F6264D96208B339E40A2;    // 0x0030   (0x0008)  
	class UAnimSequence*                               ItemFullRightArmLayer_40_C8A98D004AFAB046DEA1529B43BB53F8;  // 0x0038   (0x0008)  
	class UAnimSequence*                               ItemHandAimLayer_41_5BC791FF46DC296AA28C3CAE26F2591B;       // 0x0040   (0x0008)  
	class UAnimSequence*                               ItemHandFirecrackerLayer_43_67B3794F40861E74DF343AAA0E9023B2; // 0x0048   (0x0008)  
	class UAnimSequence*                               ItemHandSmallLayer_45_E57895C84C653CEB90EEE99CA4AA95CD;     // 0x0050   (0x0008)  
};

/// Class /Game/Characters/Campers/Dwight/Blueprint/AB_Menu_Dwight.AB_Menu_Dwight_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_Dwight_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/Dwight/Blueprint/AB_Menu_Dwight.AB_Menu_Dwight_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/AB_Menu_Dwight.AB_Menu_Dwight_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/AB_Menu_Dwight.AB_Menu_Dwight_C.ExecuteUbergraph_AB_Menu_Dwight
	// void ExecuteUbergraph_AB_Menu_Dwight(int32_t EntryPoint);                                                             // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Interfaces/BPI_AB_Camper_SubGraph_Menu.BPI_AB_Camper_SubGraph_Menu_C
/// Size: 0x0000 (0x000030 - 0x000030)
class UBPI_AB_Camper_SubGraph_Menu_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Interfaces/BPI_AB_Camper_SubGraph_Menu.BPI_AB_Camper_SubGraph_Menu_C.NoInterruptsIfSameCharacter
	// void NoInterruptsIfSameCharacter(bool NoInterrupts);                                                                  // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Interfaces/BPI_AB_Camper_SubGraph_Menu.BPI_AB_Camper_SubGraph_Menu_C.SetMenuAnimationFromMainAB
	// void SetMenuAnimationFromMainAB(FAset_Camper_Menu MenuAnimSet);                                                       // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C
/// Size: 0x1231 (0x0002C0 - 0x0014F1)
class UAB_Survivor_Subgraph_Menu_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0300   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0328   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0350   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0378   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x03A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x03C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x03F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x0418   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x0440   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x0468   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x0490   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x04B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x04E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0508   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0530   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0558   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x05D8   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x0610   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult15;                                // 0x0690   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer16;                             // 0x06C8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult17;                                // 0x0748   (0x0038)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult18;                           // 0x0780   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x07A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x07D0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x07F8   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult21;                                // 0x0828   (0x0038)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose22;                              // 0x0860   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult23;                                // 0x0890   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer24;                             // 0x08C8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult25;                                // 0x0948   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0980   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult26;                                // 0x0A30   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer27;                             // 0x0A68   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult28;                                // 0x0AE8   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine29;                               // 0x0B20   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer30;                             // 0x0BD0   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0C50   (0x00C0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0D10   (0x0158)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer31;                             // 0x0E68   (0x0080)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose32;                             // 0x0EE8   (0x0158)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend33;                           // 0x1040   (0x00C0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult34;                           // 0x1100   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult35;                           // 0x1128   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult36;                           // 0x1150   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer37;                             // 0x1178   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult38;                                // 0x11F8   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x1230   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x12B0   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer41;                             // 0x12E8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult42;                                // 0x1368   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine43;                               // 0x13A0   (0x00B0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose44;                              // 0x1450   (0x0030)  
	EItemHandPosition                                  HandPosition;                                               // 0x1480   (0x0001)  
	bool                                               RoleSelected;                                               // 0x1481   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x1482   (0x0006)  MISSED
	class UAnimSequence*                               ItemHandSmallLayer;                                         // 0x1488   (0x0008)  
	class UAnimSequence*                               ItemHandFirecrackerLayer;                                   // 0x1490   (0x0008)  
	class UAnimSequence*                               ItemHandAimLayer;                                           // 0x1498   (0x0008)  
	class UAnimSequence*                               ItemFullRightArmLayer;                                      // 0x14A0   (0x0008)  
	class UAnimSequence*                               MenuInterrupt_03;                                           // 0x14A8   (0x0008)  
	class UAnimSequence*                               MenuInterrupt_02;                                           // 0x14B0   (0x0008)  
	class UAnimSequence*                               MenuInterrupt_01;                                           // 0x14B8   (0x0008)  
	class UAnimSequence*                               MenuIdle;                                                   // 0x14C0   (0x0008)  
	class UAnimSequence*                               StartIdle;                                                  // 0x14C8   (0x0008)  
	bool                                               DebugPassToNextAnimation;                                   // 0x14D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x14D1   (0x0003)  MISSED
	int32_t                                            RandomInterrupt;                                            // 0x14D4   (0x0004)  
	class ABP_Menu_Base_Camper_C*                      BP_Menu_Base_Camper;                                        // 0x14D8   (0x0008)  
	int32_t                                            MaxIdleInterrupt;                                           // 0x14E0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x14E4   (0x0004)  MISSED
	class UAnimSequence*                               MenuIdleWithItem;                                           // 0x14E8   (0x0008)  
	bool                                               DontInterruptsIfSameCharacterInLobby;                       // 0x14F0   (0x0001)  


	/// Functions
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.ValidationForInterrupts
	// void ValidationForInterrupts(bool& CanPlayInterrupt);                                                                 // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_9970088E4C3C16B3EF740BBB5E47984C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_9970088E4C3C16B3EF740BBB5E47984C(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_F122598A4F9D1B011D1292A21F7B2570
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_F122598A4F9D1B011D1292A21F7B2570(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_D631873242E9BA4894F42D8A6DE57856
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_D631873242E9BA4894F42D8A6DE57856(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_929FD4D64CE4C1FB23C95EAC2CE28466
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_929FD4D64CE4C1FB23C95EAC2CE28466(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_D0809FA24DDDBCE57480B48E02687B56
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_D0809FA24DDDBCE57480B48E02687B56(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_62FBA6FA40D956801D6086B3678EB300
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_62FBA6FA40D956801D6086B3678EB300(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_8365519248439F8DE8823E912B9141F3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_8365519248439F8DE8823E912B9141F3(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_9959C8A14951F994497B23952F91A698
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_9959C8A14951F994497B23952F91A698(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_B2F4E5834CB5C1FE277202B944B08500
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_B2F4E5834CB5C1FE277202B944B08500(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_3AF2AA01450E0841069B67BB41D7E3E2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_3AF2AA01450E0841069B67BB41D7E3E2(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_C2986FD641D24D0FA3FBBF836793044E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_C2986FD641D24D0FA3FBBF836793044E(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_7F5CEE0941539403E81BDAB7B1729FEE
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_7F5CEE0941539403E81BDAB7B1729FEE(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_7556CA2A4F3EE0B0BA6BE9859FA3B1E7
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_7556CA2A4F3EE0B0BA6BE9859FA3B1E7(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_B03BDF754723D25A84B2D58617EBD460
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_B03BDF754723D25A84B2D58617EBD460(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_CA04D8104F686BF3EC329499FF32CC69
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Survivor_Subgraph_Menu_AnimGraphNode_TransitionResult_CA04D8104F686BF3EC329499FF32CC69(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.OnDataDrivenCVarDelegate_Event
	// void OnDataDrivenCVarDelegate_Event(FString CVarName);                                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.OnMenuAnimationStateChange
	// void OnMenuAnimationStateChange(TEnumAsByte<Enum_CamperMenuAnimationState> State);                                    // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.SetMenuAnimationFromMainAB
	// void SetMenuAnimationFromMainAB(FAset_Camper_Menu MenuAnimSet);                                                       // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.NoInterruptsIfSameCharacter
	// void NoInterruptsIfSameCharacter(bool NoInterrupts);                                                                  // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AnimBP/AnimSubGraph/AB_Survivor_Subgraph_Menu.AB_Survivor_Subgraph_Menu_C.ExecuteUbergraph_AB_Survivor_Subgraph_Menu
	// void ExecuteUbergraph_AB_Survivor_Subgraph_Menu(int32_t EntryPoint);                                                  // [0x61c32d0] Final|HasDefaults    
};

/// Class /Game/Characters/Campers/Common/AnimNotify_CamperMenuState.AnimNotify_CamperMenuState_C
/// Size: 0x0001 (0x000038 - 0x000039)
class UAnimNotify_CamperMenuState_C : public UAnimNotifyState
{ 
public:
	SDK_UNDEFINED(1,4158) /* TEnumAsByte<Enum_CamperMenuAnimationState> */ __um(AnimationState);                   // 0x0038   (0x0001)  


	/// Functions
	// Function /Game/Characters/Campers/Common/AnimNotify_CamperMenuState.AnimNotify_CamperMenuState_C.Received_NotifyBegin
	// bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration); // [0x61c32d0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Characters/Campers/Blueprints/Animation/BP_SurvivorLeftFootGroundDetector.BP_SurvivorLeftFootGroundDetector_C
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UBP_SurvivorLeftFootGroundDetector_C : public UFromBoneGroundDetectorComponent
{ 
public:
};

/// Class /Game/Characters/Campers/Blueprints/Animation/BP_SurvivorRightFootGroundDetector.BP_SurvivorRightFootGroundDetector_C
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UBP_SurvivorRightFootGroundDetector_C : public UFromBoneGroundDetectorComponent
{ 
public:
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C
/// Size: 0x0098 (0x0006C0 - 0x000758)
class ABP_Menu_Base_Camper_C : public ADBDMenuPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x06C0   (0x0008)  
	class ULobbyDialogueComponent_C*                   LobbyDialogueComponent;                                     // 0x06C8   (0x0008)  
	class UBP_SurvivorRightFootGroundDetector_C*       RightFootGroundDetector;                                    // 0x06D0   (0x0008)  
	class UBP_SurvivorLeftFootGroundDetector_C*        LeftFootGroundDetector;                                     // 0x06D8   (0x0008)  
	class UCharmSpawnerComponent*                      CharmSpawner;                                               // 0x06E0   (0x0008)  
	class UCustomizedAudioComponent*                   CustomizedAudio;                                            // 0x06E8   (0x0008)  
	class UAkComponent*                                Ak_Audio_Menu_Base_Camper;                                  // 0x06F0   (0x0008)  
	float                                              Timeline_0_Dissolve_C225B0A046EE8204E18233BA497D6AC1;       // 0x06F8   (0x0004)  
	float                                              Timeline_0_Radius_C225B0A046EE8204E18233BA497D6AC1;         // 0x06FC   (0x0004)  
	SDK_UNDEFINED(1,4159) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_0__Direction_C225B0A046EE8204E18233BA497D6AC1); // 0x0700   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0701   (0x0007)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0708   (0x0008)  
	float                                              Dissolve_Dissolve_596272B14FBF23BFE861F687F86F9EB1;         // 0x0710   (0x0004)  
	SDK_UNDEFINED(1,4160) /* TEnumAsByte<ETimelineDirection> */ __um(Dissolve__Direction_596272B14FBF23BFE861F687F86F9EB1); // 0x0714   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0715   (0x0003)  MISSED
	class UTimelineComponent*                          Dissolve;                                                   // 0x0718   (0x0008)  
	bool                                               Destroying;                                                 // 0x0720   (0x0001)  
	bool                                               PlayLocalDialogueOnly;                                      // 0x0721   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0722   (0x0006)  MISSED
	class UMaterialInstanceDynamic*                    Decal_MI;                                                   // 0x0728   (0x0008)  
	class UDecalComponent*                             Decal;                                                      // 0x0730   (0x0008)  
	SDK_UNDEFINED(16,4161) /* FMulticastInlineDelegate */ __um(OnCamperMenuInterruptChange);                       // 0x0738   (0x0010)  
	SDK_UNDEFINED(16,4162) /* FMulticastInlineDelegate */ __um(OnCamperMenuAnimationStateChange);                  // 0x0748   (0x0010)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Get_BP_MenuBaseCamper
	// void Get_BP_MenuBaseCamper(class ABP_Menu_Base_Camper_C*& BP_MenuBaseCamper);                                         // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.IsPlayingMenuInterrupt
	// void IsPlayingMenuInterrupt(bool IsPlayingAnimation);                                                                 // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Set Height
	// void Set Height();                                                                                                    // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.GetCharmSpawnerComponent
	// class UCharmSpawnerComponent* GetCharmSpawnerComponent();                                                             // [0x61c32d0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x61c32d0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Dissolve__FinishedFunc
	// void Dissolve__FinishedFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Dissolve__UpdateFunc
	// void Dissolve__UpdateFunc();                                                                                          // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                      // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.Timeline_0__Blood Effect__EventFunc
	// void Timeline_0__Blood Effect__EventFunc();                                                                           // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.BndEvt__BP_Menu_Base_Camper_CustomizedAudio_K2Node_ComponentBoundEvent_1_OutfitCustomizedAudioChangedDelegate__DelegateSignature
	// void BndEvt__BP_Menu_Base_Camper_CustomizedAudio_K2Node_ComponentBoundEvent_1_OutfitCustomizedAudioChangedDelegate__DelegateSignature(FName& outfitAudioStateCollection); // [0x61c32d0] HasOutParms|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.BeginDestroySequence_Internal
	// void BeginDestroySequence_Internal();                                                                                 // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.BeginSmokeIn
	// void BeginSmokeIn();                                                                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.RestartInSequence_Internal
	// void RestartInSequence_Internal();                                                                                    // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.BndEvt__CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature
	// void BndEvt__CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature(EAudioCustomizationCategory category, FString switchState); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnLocalPlayerSpawned
	// void OnLocalPlayerSpawned();                                                                                          // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnGuestPlayerSpawned
	// void OnGuestPlayerSpawned(class ADBDMenuPlayer* Player);                                                              // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnLocalPlayerReadyChanged
	// void OnLocalPlayerReadyChanged(bool IsReady);                                                                         // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnGuestPlayerReadyChanged
	// void OnGuestPlayerReadyChanged(class ADBDMenuPlayer* Player, bool IsReady);                                           // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnAllPlayersReadyInOnlineLobby
	// void OnAllPlayersReadyInOnlineLobby();                                                                                // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnSkeletalMeshReady
	// void OnSkeletalMeshReady();                                                                                           // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnGuestPlayerDespawned
	// void OnGuestPlayerDespawned(class ADBDMenuPlayer* Player);                                                            // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.PlayCharacterLevelUpVFX
	// void PlayCharacterLevelUpVFX();                                                                                       // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.SetCamperMenuAnimationState
	// void SetCamperMenuAnimationState(TEnumAsByte<Enum_CamperMenuAnimationState> State);                                   // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnPlayerMaxPrestige
	// void OnPlayerMaxPrestige();                                                                                           // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.ExecuteUbergraph_BP_Menu_Base_Camper
	// void ExecuteUbergraph_BP_Menu_Base_Camper(int32_t EntryPoint);                                                        // [0x61c32d0] Final|HasDefaults    
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnCamperMenuAnimationStateChange__DelegateSignature
	// void OnCamperMenuAnimationStateChange__DelegateSignature(TEnumAsByte<Enum_CamperMenuAnimationState> State);           // [0x61c32d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_Base_Camper.BP_Menu_Base_Camper_C.OnCamperMenuInterruptChange__DelegateSignature
	// void OnCamperMenuInterruptChange__DelegateSignature(int32_t MenuInterrupt, bool DebugPassCurrentAnimation);           // [0x61c32d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms2_SurvivorCharmsChains.AB_DF_ForwardCharms2_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_DF_ForwardCharms2_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4163) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1856A5C44048A03FFB1DF89ADF4CA5EA); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1856A5C44048A03FFB1DF89ADF4CA5EA; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1856A5C44048A03FFB1DF89ADF4CA5EA; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4164) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1856A5C44048A03FFB1DF89ADF4CA5EA); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4165) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_5DF30D2E4BE44DD4557888B3E40B39A3); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_5DF30D2E4BE44DD4557888B3E40B39A3; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_5DF30D2E4BE44DD4557888B3E40B39A3; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4166) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_5DF30D2E4BE44DD4557888B3E40B39A3); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4167) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_AFF90BFF4C684E0E97F860BBE15A6E8B); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_AFF90BFF4C684E0E97F860BBE15A6E8B; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_AFF90BFF4C684E0E97F860BBE15A6E8B; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4168) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_AFF90BFF4C684E0E97F860BBE15A6E8B); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms2_SurvivorCharmsChains.AB_DF_ForwardCharms2_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms2_SurvivorCharmsChains.AB_DF_ForwardCharms2_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms2_SurvivorCharmsChains.AB_DF_ForwardCharms2_SurvivorCharmsChains_C.ExecuteUbergraph_AB_DF_ForwardCharms2_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_DF_ForwardCharms2_SurvivorCharmsChains(int32_t EntryPoint);                                  // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms1_SurvivorCharmsChains.AB_DF_ForwardCharms1_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_DF_ForwardCharms1_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4169) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_AEC3AAAE43C45E79CBA5F5A8C624BC1F); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_AEC3AAAE43C45E79CBA5F5A8C624BC1F; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_AEC3AAAE43C45E79CBA5F5A8C624BC1F; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4170) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_AEC3AAAE43C45E79CBA5F5A8C624BC1F); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4171) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1AE978D84C88B2E14C9F87986CCDB12E); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1AE978D84C88B2E14C9F87986CCDB12E; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1AE978D84C88B2E14C9F87986CCDB12E; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4172) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1AE978D84C88B2E14C9F87986CCDB12E); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4173) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_951338BB44F92B111D7217BC8256D115); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_951338BB44F92B111D7217BC8256D115; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_951338BB44F92B111D7217BC8256D115; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4174) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_951338BB44F92B111D7217BC8256D115); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms1_SurvivorCharmsChains.AB_DF_ForwardCharms1_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms1_SurvivorCharmsChains.AB_DF_ForwardCharms1_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_ForwardCharms1_SurvivorCharmsChains.AB_DF_ForwardCharms1_SurvivorCharmsChains_C.ExecuteUbergraph_AB_DF_ForwardCharms1_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_DF_ForwardCharms1_SurvivorCharmsChains(int32_t EntryPoint);                                  // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_Default_SurvivorCharmsChains.AB_DF_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_DF_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4175) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_82679245447718234B56BC80E31B651A); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_82679245447718234B56BC80E31B651A; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_82679245447718234B56BC80E31B651A; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4176) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_82679245447718234B56BC80E31B651A); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4177) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_08AE9DBF4CB3A1D6E90F4DADEA14A699); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_08AE9DBF4CB3A1D6E90F4DADEA14A699; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_08AE9DBF4CB3A1D6E90F4DADEA14A699; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4178) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_08AE9DBF4CB3A1D6E90F4DADEA14A699); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4179) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_860B63B14EB48ED7673A07BF4E0D9F77); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_860B63B14EB48ED7673A07BF4E0D9F77; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_860B63B14EB48ED7673A07BF4E0D9F77; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4180) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_860B63B14EB48ED7673A07BF4E0D9F77); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_Default_SurvivorCharmsChains.AB_DF_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_Default_SurvivorCharmsChains.AB_DF_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Dwight/Blueprint/Charms/AB_DF_Default_SurvivorCharmsChains.AB_DF_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_DF_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_DF_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale01.BP_Menu_CamperMale01_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale01_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Shortcoat_SurvivorCharmsChains.AB_MT_Shortcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_MT_Shortcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4181) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_B77E50DB4FE5F5DA498C568F54D17F1D); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_B77E50DB4FE5F5DA498C568F54D17F1D; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_B77E50DB4FE5F5DA498C568F54D17F1D; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4182) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_B77E50DB4FE5F5DA498C568F54D17F1D); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4183) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_F184BB5042C09AE7CAEDC28C7C82749F); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_F184BB5042C09AE7CAEDC28C7C82749F; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_F184BB5042C09AE7CAEDC28C7C82749F; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4184) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_F184BB5042C09AE7CAEDC28C7C82749F); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4185) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_0E9A9BAB436AF9A2F03A89982642797D); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_0E9A9BAB436AF9A2F03A89982642797D; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_0E9A9BAB436AF9A2F03A89982642797D; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4186) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_0E9A9BAB436AF9A2F03A89982642797D); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Shortcoat_SurvivorCharmsChains.AB_MT_Shortcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Shortcoat_SurvivorCharmsChains.AB_MT_Shortcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Shortcoat_SurvivorCharmsChains.AB_MT_Shortcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_MT_Shortcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_MT_Shortcoat_SurvivorCharmsChains(int32_t EntryPoint);                                       // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Longcoat_SurvivorCharmsChains.AB_MT_Longcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_MT_Longcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4187) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_E98E53014C900C0E2D4EED8D8A087E40); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_E98E53014C900C0E2D4EED8D8A087E40; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_E98E53014C900C0E2D4EED8D8A087E40; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4188) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_E98E53014C900C0E2D4EED8D8A087E40); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4189) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1F7C1C9545B3CBFD54FF5A93DCA60219); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1F7C1C9545B3CBFD54FF5A93DCA60219; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4190) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1F7C1C9545B3CBFD54FF5A93DCA60219); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4191) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_7CFB7B874784EFCC1F6542A41222AEFD); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_7CFB7B874784EFCC1F6542A41222AEFD; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_7CFB7B874784EFCC1F6542A41222AEFD; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4192) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_7CFB7B874784EFCC1F6542A41222AEFD); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Longcoat_SurvivorCharmsChains.AB_MT_Longcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Longcoat_SurvivorCharmsChains.AB_MT_Longcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Longcoat_SurvivorCharmsChains.AB_MT_Longcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_MT_Longcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_MT_Longcoat_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Default_SurvivorCharmsChains.AB_MT_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_MT_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4193) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_CEF6E87D44588967024F1F870F3CB294); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_CEF6E87D44588967024F1F870F3CB294; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_CEF6E87D44588967024F1F870F3CB294; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4194) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_CEF6E87D44588967024F1F870F3CB294); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4195) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_A0E3CD0F453B30E7DD8CA49BC705F14D); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_A0E3CD0F453B30E7DD8CA49BC705F14D; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_A0E3CD0F453B30E7DD8CA49BC705F14D; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4196) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_A0E3CD0F453B30E7DD8CA49BC705F14D); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4197) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_D6ED30EC4CD3386EE32F179D248869EB); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_D6ED30EC4CD3386EE32F179D248869EB; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_D6ED30EC4CD3386EE32F179D248869EB; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4198) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_D6ED30EC4CD3386EE32F179D248869EB); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Default_SurvivorCharmsChains.AB_MT_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Default_SurvivorCharmsChains.AB_MT_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Meg/Blueprint/Charms/AB_MT_Default_SurvivorCharmsChains.AB_MT_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_MT_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_MT_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale01.BP_Menu_CamperFemale01_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperFemale01_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C
/// Size: 0x1858 (0x0002C0 - 0x001B18)
class UAB_Menu_Camper_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0300   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0328   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0350   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0378   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x03A8   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03E0   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0460   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer2;                              // 0x0500   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult3;                                 // 0x0580   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer4;                              // 0x05B8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult5;                                 // 0x0638   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0670   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer6;                              // 0x0720   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult7;                                 // 0x07A0   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine8;                                // 0x07D8   (0x00B0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool9;                             // 0x0888   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer10;                             // 0x0928   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer11;                             // 0x09A8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer12;                             // 0x0A28   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer13;                             // 0x0AA8   (0x0080)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0B28   (0x0158)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0C80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0CA8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose16;                              // 0x0CD0   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult17;                                // 0x0D00   (0x0038)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0D38   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose18;                              // 0x0D58   (0x0030)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0D88   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DA8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DB0   (0x0460)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x1210   (0x0138)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult19;                                // 0x1348   (0x0038)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose20;                              // 0x1380   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult21;                                // 0x13B0   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine22;                               // 0x13E8   (0x00B0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool23;                            // 0x1498   (0x00A0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose24;                              // 0x1538   (0x0030)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose25;                             // 0x1568   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose26;                              // 0x16C0   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x16F0   (0x0110)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace27;                      // 0x1800   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace28;                      // 0x1820   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1840   (0x00C0)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend29;                           // 0x1900   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool30;                            // 0x19C0   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool31;                            // 0x1A60   (0x00A0)  
	EItemHandPosition                                  Hand_Position;                                              // 0x1B00   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x1B01   (0x0003)  MISSED
	int32_t                                            SelectedIdleIndex;                                          // 0x1B04   (0x0004)  
	bool                                               Role_Selected;                                              // 0x1B08   (0x0001)  
	bool                                               Dynamic_Override;                                           // 0x1B09   (0x0001)  
	bool                                               Override_nea;                                               // 0x1B0A   (0x0001)  
	bool                                               Override_Jane;                                              // 0x1B0B   (0x0001)  
	bool                                               _weaponRT_adjustment;                                       // 0x1B0C   (0x0001)  
	bool                                               MenuInterrupt;                                              // 0x1B0D   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x1B0E   (0x0002)  MISSED
	class ADBDMenuPlayer*                              DBDMenuPlayer;                                              // 0x1B10   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.Get_BP_MenuBaseCamper
	// void Get_BP_MenuBaseCamper(class ABP_Menu_Base_Camper_C*& BP_MenuBaseCamper);                                         // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_144CBC12420AC4B1AEB6C483367DB5D1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_144CBC12420AC4B1AEB6C483367DB5D1(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_D31FAC3144F53773EC44BF83B1E4C609
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_D31FAC3144F53773EC44BF83B1E4C609(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_LayeredBoneBlend_942BFBC04EC5441670A131B2CBD7B90D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_LayeredBoneBlend_942BFBC04EC5441670A131B2CBD7B90D(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_LayeredBoneBlend_31D12DEB4EEE47CA5AFD35BA4FF29D01
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_LayeredBoneBlend_31D12DEB4EEE47CA5AFD35BA4FF29D01(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_ModifyBone_F80FCF524110A51D7C4B38A1720994C7
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_ModifyBone_F80FCF524110A51D7C4B38A1720994C7(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_TransitionResult_87CDC7454897F2F416A5B78669C05DF6
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_TransitionResult_87CDC7454897F2F416A5B78669C05DF6(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_747405E04A935FAD9C72CBB1F0F32382
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_BlendListByBool_747405E04A935FAD9C72CBB1F0F32382(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_TransitionResult_BA6696174B4541A7601209A8053A34AA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Camper_AnimGraphNode_TransitionResult_BA6696174B4541A7601209A8053A34AA(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.SetCamperMenuAnimationState
	// void SetCamperMenuAnimationState(TEnumAsByte<Enum_CamperMenuAnimationState> State);                                   // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.AnimNotify_IsPlayingMenuInterruptFromTransition
	// void AnimNotify_IsPlayingMenuInterruptFromTransition();                                                               // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.AnimNotify_IsLeavingMenuInterruptFromTransition
	// void AnimNotify_IsLeavingMenuInterruptFromTransition();                                                               // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.RandomTimer
	// void RandomTimer();                                                                                                   // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.IsPlayingMenuInterrupt
	// void IsPlayingMenuInterrupt(bool IsPlayingAnimation);                                                                 // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Common/AB_Menu_Camper.AB_Menu_Camper_C.ExecuteUbergraph_AB_Menu_Camper
	// void ExecuteUbergraph_AB_Menu_Camper(int32_t EntryPoint);                                                             // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Meg/Blueprint/AB_Menu_Meg.AB_Menu_Meg_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Meg_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Verylongcoat_SurvivorCharmsChains.AB_CM_Verylongcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_CM_Verylongcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4199) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_D240A99A499DAF8054BD4AAAF3B0A104); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_D240A99A499DAF8054BD4AAAF3B0A104; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_D240A99A499DAF8054BD4AAAF3B0A104; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4200) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_D240A99A499DAF8054BD4AAAF3B0A104); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4201) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_54CD276D445B34F6170153B8BE096F38); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_54CD276D445B34F6170153B8BE096F38; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_54CD276D445B34F6170153B8BE096F38; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4202) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_54CD276D445B34F6170153B8BE096F38); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4203) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_8AEDD79145647DA0DEC7DC91A1875A6A); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_8AEDD79145647DA0DEC7DC91A1875A6A; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_8AEDD79145647DA0DEC7DC91A1875A6A; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4204) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_8AEDD79145647DA0DEC7DC91A1875A6A); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Verylongcoat_SurvivorCharmsChains.AB_CM_Verylongcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Verylongcoat_SurvivorCharmsChains.AB_CM_Verylongcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Verylongcoat_SurvivorCharmsChains.AB_CM_Verylongcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_CM_Verylongcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_CM_Verylongcoat_SurvivorCharmsChains(int32_t EntryPoint);                                    // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Shortcoat_SurvivorCharmsChains.AB_CM_Shortcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_CM_Shortcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4205) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1F82EF1D4FF1BD484A7669BCA0CD29A6); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1F82EF1D4FF1BD484A7669BCA0CD29A6; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1F82EF1D4FF1BD484A7669BCA0CD29A6; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4206) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1F82EF1D4FF1BD484A7669BCA0CD29A6); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4207) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_B01E76F94F51AA012069E7A5D2C540A9); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_B01E76F94F51AA012069E7A5D2C540A9; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_B01E76F94F51AA012069E7A5D2C540A9; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4208) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_B01E76F94F51AA012069E7A5D2C540A9); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4209) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_AF098D604C62E21E7CE00DB0C24692F3); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_AF098D604C62E21E7CE00DB0C24692F3; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_AF098D604C62E21E7CE00DB0C24692F3; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4210) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_AF098D604C62E21E7CE00DB0C24692F3); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Shortcoat_SurvivorCharmsChains.AB_CM_Shortcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Shortcoat_SurvivorCharmsChains.AB_CM_Shortcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Shortcoat_SurvivorCharmsChains.AB_CM_Shortcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_CM_Shortcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_CM_Shortcoat_SurvivorCharmsChains(int32_t EntryPoint);                                       // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Longcoat_SurvivorCharmsChains.AB_CM_Longcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_CM_Longcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4211) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_F9828C0541DB37970FBE08AF786D0D8E); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_F9828C0541DB37970FBE08AF786D0D8E; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_F9828C0541DB37970FBE08AF786D0D8E; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4212) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_F9828C0541DB37970FBE08AF786D0D8E); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4213) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_014373944ECE899F139ED2BEAB8BE8D0); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_014373944ECE899F139ED2BEAB8BE8D0; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_014373944ECE899F139ED2BEAB8BE8D0; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4214) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_014373944ECE899F139ED2BEAB8BE8D0); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4215) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1D2E06664FEED68ABD9185A98680B181); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1D2E06664FEED68ABD9185A98680B181; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1D2E06664FEED68ABD9185A98680B181; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4216) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1D2E06664FEED68ABD9185A98680B181); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Longcoat_SurvivorCharmsChains.AB_CM_Longcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Longcoat_SurvivorCharmsChains.AB_CM_Longcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Longcoat_SurvivorCharmsChains.AB_CM_Longcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_CM_Longcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_CM_Longcoat_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Default_SurvivorCharmsChains.AB_CM_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_CM_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4217) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_3A681B43460165F35E06DD9A2EE45E26); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_3A681B43460165F35E06DD9A2EE45E26; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_3A681B43460165F35E06DD9A2EE45E26; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4218) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_3A681B43460165F35E06DD9A2EE45E26); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4219) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_4599BD314B9F1767274CDB9D73BA61ED); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_4599BD314B9F1767274CDB9D73BA61ED; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_4599BD314B9F1767274CDB9D73BA61ED; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4220) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_4599BD314B9F1767274CDB9D73BA61ED); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4221) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_0804E5934FEE13438C7915A82D09080E); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_0804E5934FEE13438C7915A82D09080E; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_0804E5934FEE13438C7915A82D09080E; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4222) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_0804E5934FEE13438C7915A82D09080E); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Default_SurvivorCharmsChains.AB_CM_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Default_SurvivorCharmsChains.AB_CM_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/Charms/AB_CM_Default_SurvivorCharmsChains.AB_CM_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_CM_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_CM_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale02.BP_Menu_CamperFemale02_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperFemale02_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Claudette/Blueprints/AB_Menu_Claudette.AB_Menu_Claudette_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_Claudette_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/Claudette/Blueprints/AB_Menu_Claudette.AB_Menu_Claudette_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/AB_Menu_Claudette.AB_Menu_Claudette_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Claudette/Blueprints/AB_Menu_Claudette.AB_Menu_Claudette_C.ExecuteUbergraph_AB_Menu_Claudette
	// void ExecuteUbergraph_AB_Menu_Claudette(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale02.BP_Menu_CamperMale02_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale02_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Jake/Blueprint/AB_Menu_Jake.AB_Menu_Jake_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Jake_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_SuperLongcoat_SurvivorCharmsChains.AB_NK_SuperLongcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_NK_SuperLongcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4223) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_719BF4244A61A3E2B66CE78F7F4D969F); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_719BF4244A61A3E2B66CE78F7F4D969F; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_719BF4244A61A3E2B66CE78F7F4D969F; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4224) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_719BF4244A61A3E2B66CE78F7F4D969F); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4225) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_BF26D86549B59ADB2EABDEB926A72252); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_BF26D86549B59ADB2EABDEB926A72252; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_BF26D86549B59ADB2EABDEB926A72252; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4226) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_BF26D86549B59ADB2EABDEB926A72252); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4227) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_23B8D95E42A8C107114AE18305F9ADC8); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_23B8D95E42A8C107114AE18305F9ADC8; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_23B8D95E42A8C107114AE18305F9ADC8; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4228) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_23B8D95E42A8C107114AE18305F9ADC8); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_SuperLongcoat_SurvivorCharmsChains.AB_NK_SuperLongcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_SuperLongcoat_SurvivorCharmsChains.AB_NK_SuperLongcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_SuperLongcoat_SurvivorCharmsChains.AB_NK_SuperLongcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_NK_SuperLongcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_NK_SuperLongcoat_SurvivorCharmsChains(int32_t EntryPoint);                                   // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Midcoat_SurvivorCharmsChains.AB_NK_Midcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_NK_Midcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4229) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_2B71CD104F6B375108E94BAED85AB9DC); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_2B71CD104F6B375108E94BAED85AB9DC; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_2B71CD104F6B375108E94BAED85AB9DC; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4230) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_2B71CD104F6B375108E94BAED85AB9DC); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4231) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_FC84659044DDE745683014A853C53820); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_FC84659044DDE745683014A853C53820; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_FC84659044DDE745683014A853C53820; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4232) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_FC84659044DDE745683014A853C53820); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4233) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_F994B64540C25289275A73B17207D536); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_F994B64540C25289275A73B17207D536; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_F994B64540C25289275A73B17207D536; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4234) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_F994B64540C25289275A73B17207D536); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Midcoat_SurvivorCharmsChains.AB_NK_Midcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Midcoat_SurvivorCharmsChains.AB_NK_Midcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Midcoat_SurvivorCharmsChains.AB_NK_Midcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_NK_Midcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_NK_Midcoat_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Longcoat_SurvivorCharmsChains.AB_NK_Longcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_NK_Longcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4235) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_2BF764AC430A7AB741CBDFAA0C7BA741); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_2BF764AC430A7AB741CBDFAA0C7BA741; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_2BF764AC430A7AB741CBDFAA0C7BA741; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4236) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_2BF764AC430A7AB741CBDFAA0C7BA741); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4237) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_7C2DB4ED476F7D0C1368D9980811D406); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_7C2DB4ED476F7D0C1368D9980811D406; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_7C2DB4ED476F7D0C1368D9980811D406; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4238) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_7C2DB4ED476F7D0C1368D9980811D406); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4239) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_D7ABDF914222D6C28665E0BA87E25014); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_D7ABDF914222D6C28665E0BA87E25014; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_D7ABDF914222D6C28665E0BA87E25014; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4240) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_D7ABDF914222D6C28665E0BA87E25014); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Longcoat_SurvivorCharmsChains.AB_NK_Longcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Longcoat_SurvivorCharmsChains.AB_NK_Longcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Longcoat_SurvivorCharmsChains.AB_NK_Longcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_NK_Longcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_NK_Longcoat_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Default_SurvivorCharmsChains.AB_NK_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_NK_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4241) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_9BF63DCB4B62CB40F48A6BAD319A872A); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_9BF63DCB4B62CB40F48A6BAD319A872A; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_9BF63DCB4B62CB40F48A6BAD319A872A; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4242) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_9BF63DCB4B62CB40F48A6BAD319A872A); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4243) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_993F174440FC94C7BC57C9A87FB8AA83); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_993F174440FC94C7BC57C9A87FB8AA83; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_993F174440FC94C7BC57C9A87FB8AA83; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4244) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_993F174440FC94C7BC57C9A87FB8AA83); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4245) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_C81461DF49DCB6F22BBF339D9116080A); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_C81461DF49DCB6F22BBF339D9116080A; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_C81461DF49DCB6F22BBF339D9116080A; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4246) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_C81461DF49DCB6F22BBF339D9116080A); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Default_SurvivorCharmsChains.AB_NK_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Default_SurvivorCharmsChains.AB_NK_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Default_SurvivorCharmsChains.AB_NK_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_NK_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_NK_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Buffpants1_SurvivorCharmsChains.AB_NK_Buffpants1_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_NK_Buffpants1_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4247) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_03C6B55142C69C083969F08EE19E31E9); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_03C6B55142C69C083969F08EE19E31E9; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_03C6B55142C69C083969F08EE19E31E9; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4248) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_03C6B55142C69C083969F08EE19E31E9); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4249) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_BD9766E643123AD4C4358F92EAFF429E); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_BD9766E643123AD4C4358F92EAFF429E; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_BD9766E643123AD4C4358F92EAFF429E; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4250) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_BD9766E643123AD4C4358F92EAFF429E); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4251) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_FB325E4F4ECEA30A67245D9A48A47045); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_FB325E4F4ECEA30A67245D9A48A47045; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_FB325E4F4ECEA30A67245D9A48A47045; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4252) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_FB325E4F4ECEA30A67245D9A48A47045); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Buffpants1_SurvivorCharmsChains.AB_NK_Buffpants1_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Buffpants1_SurvivorCharmsChains.AB_NK_Buffpants1_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Nea/Blueprint/Charms/AB_NK_Buffpants1_SurvivorCharmsChains.AB_NK_Buffpants1_SurvivorCharmsChains_C.ExecuteUbergraph_AB_NK_Buffpants1_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_NK_Buffpants1_SurvivorCharmsChains(int32_t EntryPoint);                                      // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale03.BP_Menu_CamperFemale03_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale03_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale03.BP_Menu_CamperFemale03_C.ExecuteUbergraph_BP_Menu_CamperFemale03
	// void ExecuteUbergraph_BP_Menu_CamperFemale03(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Nea/Blueprint/AB_Menu_Nea.AB_Menu_Nea_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Nea_C : public UAB_Menu_Camper_C
{ 
public:


	/// Functions
	// Function /Game/Characters/Campers/Nea/Blueprint/AB_Menu_Nea.AB_Menu_Nea_C.Override_nea
	// void Override_nea(bool& Return);                                                                                      // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Characters/Campers/Nea/Blueprint/AB_Menu_Nea.AB_Menu_Nea_C.Override_Dynamic
	// void Override_Dynamic(bool& Return);                                                                                  // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale03.BP_Menu_CamperMale03_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale03_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Ace/Blueprint/AB_Menu_Ace.AB_Menu_Ace_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_Ace_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/Ace/Blueprint/AB_Menu_Ace.AB_Menu_Ace_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Ace/Blueprint/AB_Menu_Ace.AB_Menu_Ace_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Ace/Blueprint/AB_Menu_Ace.AB_Menu_Ace_C.ExecuteUbergraph_AB_Menu_Ace
	// void ExecuteUbergraph_AB_Menu_Ace(int32_t EntryPoint);                                                                // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Animation/BP_KillerRightFootGroundDetector.BP_KillerRightFootGroundDetector_C
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UBP_KillerRightFootGroundDetector_C : public UFromBoneGroundDetectorComponent
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Animation/BP_KillerLeftFootGroundDetector.BP_KillerLeftFootGroundDetector_C
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UBP_KillerLeftFootGroundDetector_C : public UFromBoneGroundDetectorComponent
{ 
public:
};

/// Class /Game/Characters/Slashers/Animations/MenuAnimationSync/AnimNotify_SlasherMenuState.AnimNotify_SlasherMenuState_C
/// Size: 0x0001 (0x000038 - 0x000039)
class UAnimNotify_SlasherMenuState_C : public UAnimNotifyState
{ 
public:
	SDK_UNDEFINED(1,4253) /* TEnumAsByte<Enum_MenuAnimationState> */ __um(AnimationState);                         // 0x0038   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Animations/MenuAnimationSync/AnimNotify_SlasherMenuState.AnimNotify_SlasherMenuState_C.Received_NotifyBegin
	// bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration); // [0x61c32d0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Characters/Slashers/Blueprints/Anim_SubGraph/BPI_AB_Slasher_SubGraph_Menu.BPI_AB_Slasher_SubGraph_Menu_C
/// Size: 0x0000 (0x000030 - 0x000030)
class UBPI_AB_Slasher_SubGraph_Menu_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/BPI_AB_Slasher_SubGraph_Menu.BPI_AB_Slasher_SubGraph_Menu_C.SetMenuAnimationFromMainAB
	// void SetMenuAnimationFromMainAB(FAset_Slasher_Menu& MenuAnimSet);                                                     // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C
/// Size: 0x09BC (0x000300 - 0x000CBC)
class UAB_Slasher_SubGraph_Menu_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0340   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool0;                             // 0x03E0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0480   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer1;                              // 0x0500   (0x0080)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0580   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x05A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x05D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x05F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0620   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x0648   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x0670   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x0698   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x06C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x06E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x0710   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0738   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0760   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x0788   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0808   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer15;                             // 0x0840   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult16;                                // 0x08C0   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x08F8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult18;                                // 0x0978   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer19;                             // 0x09B0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult20;                                // 0x0A30   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0A68   (0x00B0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0B18   (0x0110)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0C28   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0C48   (0x0020)  
	bool                                               Role_Selected;                                              // 0x0C68   (0x0001)  
	bool                                               Is_Online;                                                  // 0x0C69   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0C6A   (0x0002)  MISSED
	int32_t                                            RandomInterrupt;                                            // 0x0C6C   (0x0004)  
	class ABP_Menu_BaseSlasher_C*                      BP_Menu_Base_Slasher;                                       // 0x0C70   (0x0008)  
	class UAnimSequenceBase*                           MenuLobby;                                                  // 0x0C78   (0x0008)  
	class UAnimSequenceBase*                           MenuIdle;                                                   // 0x0C80   (0x0008)  
	class UAnimSequenceBase*                           MenuIdleInterrupt01;                                        // 0x0C88   (0x0008)  
	class UAnimSequenceBase*                           MenuIdleInterrupt02;                                        // 0x0C90   (0x0008)  
	class UAnimSequenceBase*                           MenuIdleBack;                                               // 0x0C98   (0x0008)  
	class UAnimSequenceBase*                           MenuIdleInterrupt03;                                        // 0x0CA0   (0x0008)  
	bool                                               DebugPassToNextAnimation;                                   // 0x0CA8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0CA9   (0x0003)  MISSED
	FVector                                            ScaleInLobby;                                               // 0x0CAC   (0x000C)  
	int32_t                                            MaxIdleInterrupt;                                           // 0x0CB8   (0x0004)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_5E15DFE240AEAD5F916B15B2D5014F50
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_5E15DFE240AEAD5F916B15B2D5014F50(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_42AEC6A94D9FEBC8B69A338767976D8B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_42AEC6A94D9FEBC8B69A338767976D8B(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_3E3ABF8E4F276B5FBBFA5697451292CF
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_3E3ABF8E4F276B5FBBFA5697451292CF(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_13069AA346A598DDCD65FEB86788577B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_13069AA346A598DDCD65FEB86788577B(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_EE90647340D120A12EF9CD9BF02FCFA5
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_EE90647340D120A12EF9CD9BF02FCFA5(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_6D2F7FB540BF4660E4584AB0B255221D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_6D2F7FB540BF4660E4584AB0B255221D(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_342F73ED4DFC794BEF5B00B8DC5E510A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_342F73ED4DFC794BEF5B00B8DC5E510A(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_315C8E6444B60C3D4699AC863DECF763
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_315C8E6444B60C3D4699AC863DECF763(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_04C4447E4876DF7C16F670AC9A94544D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Menu_AnimGraphNode_TransitionResult_04C4447E4876DF7C16F670AC9A94544D(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.SetMenuAnimationFromMainAB
	// void SetMenuAnimationFromMainAB(FAset_Slasher_Menu& MenuAnimSet);                                                     // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.OnDataDrivenCVarDelegate_Event
	// void OnDataDrivenCVarDelegate_Event(FString CVarName);                                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.OnMenuAnimationStateChange
	// void OnMenuAnimationStateChange(TEnumAsByte<Enum_MenuAnimationState> State);                                          // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Anim_SubGraph/AB_Slasher_SubGraph_Menu.AB_Slasher_SubGraph_Menu_C.ExecuteUbergraph_AB_Slasher_SubGraph_Menu
	// void ExecuteUbergraph_AB_Slasher_SubGraph_Menu(int32_t EntryPoint);                                                   // [0x61c32d0] Final|HasDefaults    
};

/// Class /Game/Characters/Slashers/Blueprints/Interfaces/BPI_MenuSlasher.BPI_MenuSlasher_C
/// Size: 0x0000 (0x000030 - 0x000030)
class UBPI_MenuSlasher_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Interfaces/BPI_MenuSlasher.BPI_MenuSlasher_C.GetMenuBaseSlasher
	// void GetMenuBaseSlasher(class ABP_Menu_BaseSlasher_C*& Bp_MenuBaseSlasher);                                           // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Interfaces/BPI_MenuSlasher.BPI_MenuSlasher_C.SetMenuAnimationState
	// void SetMenuAnimationState(TEnumAsByte<Enum_MenuAnimationState> State);                                               // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
};

/// Struct /Game/Characters/Slashers/Animations/AnimSets/Aset_Slasher_Menu.Aset_Slasher_Menu
/// Size: 0x0038 (0x000000 - 0x000038)
struct FAset_Slasher_Menu
{ 
	int32_t                                            IdleInterruptQuantity_35_3BE7C7644CFA1ADF9841D5BE4D3A7FED;  // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UAnimSequence*                               MenuIdle_18_FFD6BA49453CFEA6D8A893B6109C431F;               // 0x0008   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt01_19_31F0358C4D2070DFC9142F820362D54F;    // 0x0010   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt02_22_0519AE00431F80436F2653995DB3AF63;    // 0x0018   (0x0008)  
	class UAnimSequence*                               MenuIdleInterrupt03_31_C1F95CFA4C45F6264D96208B339E40A2;    // 0x0020   (0x0008)  
	class UAnimSequence*                               MenuLobby_24_C8A98D004AFAB046DEA1529B43BB53F8;              // 0x0028   (0x0008)  
	class UAnimSequence*                               MenuBack_26_5BC791FF46DC296AA28C3CAE26F2591B;               // 0x0030   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher01.AB_Menu_Slasher01_C
/// Size: 0x0128 (0x000300 - 0x000428)
class UAB_Menu_Slasher01_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	EGameFlowStep                                      CurrentMenu;                                                // 0x03E8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x03E9   (0x0007)  MISSED
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03F0   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher01.AB_Menu_Slasher01_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher01.AB_Menu_Slasher01_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher01.AB_Menu_Slasher01_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher01.AB_Menu_Slasher01_C.ExecuteUbergraph_AB_Menu_Slasher01
	// void ExecuteUbergraph_AB_Menu_Slasher01(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C
/// Size: 0x00B9 (0x0006C0 - 0x000779)
class ABP_Menu_BaseSlasher_C : public ADBDMenuPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x06C0   (0x0008)  
	class ULobbyDialogueComponent_C*                   LobbyDialogueComponent;                                     // 0x06C8   (0x0008)  
	class UBP_KillerRightFootGroundDetector_C*         RightFootGroundDetector;                                    // 0x06D0   (0x0008)  
	class UBP_KillerLeftFootGroundDetector_C*          LeftFootGroundDetector;                                     // 0x06D8   (0x0008)  
	class UCustomizedAudioComponent*                   CustomizedAudio;                                            // 0x06E0   (0x0008)  
	class UAkComponent*                                Ak_Audio_Menu_Base_Slasher;                                 // 0x06E8   (0x0008)  
	float                                              Timeline_0_Dissolve_8C0E9079408DDB2CEF13CDAD072137A5;       // 0x06F0   (0x0004)  
	float                                              Timeline_0_Radius_8C0E9079408DDB2CEF13CDAD072137A5;         // 0x06F4   (0x0004)  
	SDK_UNDEFINED(1,4254) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_0__Direction_8C0E9079408DDB2CEF13CDAD072137A5); // 0x06F8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x06F9   (0x0007)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0700   (0x0008)  
	float                                              TML_DissolveSlasher_Dissolve_6A8353EF46DC9749463CE0935534B1A4; // 0x0708   (0x0004)  
	SDK_UNDEFINED(1,4255) /* TEnumAsByte<ETimelineDirection> */ __um(TML_DissolveSlasher__Direction_6A8353EF46DC9749463CE0935534B1A4); // 0x070C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x070D   (0x0003)  MISSED
	class UTimelineComponent*                          TML_DissolveSlasher;                                        // 0x0710   (0x0008)  
	bool                                               IsInMenu;                                                   // 0x0718   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0719   (0x0007)  MISSED
	SDK_UNDEFINED(16,4256) /* TArray<TWeakObjectPtr<UAkAudioBank*>> */ __um(RequiredSoundBanks);                   // 0x0720   (0x0010)  
	TArray<class UObject*>                             AssignedSoundBanks;                                         // 0x0730   (0x0010)  
	float                                              SlasherHeight;                                              // 0x0740   (0x0004)  
	float                                              SlasherHeightBase;                                          // 0x0744   (0x0004)  
	SDK_UNDEFINED(16,4257) /* FMulticastInlineDelegate */ __um(OnMenuAnimationStateChange);                        // 0x0748   (0x0010)  
	SDK_UNDEFINED(16,4258) /* FMulticastInlineDelegate */ __um(OnMenuInterruptChange);                             // 0x0758   (0x0010)  
	class UDecalComponent*                             Decal;                                                      // 0x0768   (0x0008)  
	class UMaterialInstanceDynamic*                    Decal_MI;                                                   // 0x0770   (0x0008)  
	bool                                               PlayLocalDialogueOnly;                                      // 0x0778   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.GetMenuBaseSlasher
	// void GetMenuBaseSlasher(class ABP_Menu_BaseSlasher_C*& Bp_MenuBaseSlasher);                                           // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.IsInMenuPlayer
	// bool IsInMenuPlayer();                                                                                                // [0x61c32d0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.UpdateHeight
	// void UpdateHeight();                                                                                                  // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.TML_DissolveSlasher__FinishedFunc
	// void TML_DissolveSlasher__FinishedFunc();                                                                             // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.TML_DissolveSlasher__UpdateFunc
	// void TML_DissolveSlasher__UpdateFunc();                                                                               // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                      // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.Timeline_0__Blood Effect__EventFunc
	// void Timeline_0__Blood Effect__EventFunc();                                                                           // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.BndEvt__BP_Menu_BaseSlasher_CustomizedAudio_K2Node_ComponentBoundEvent_1_OutfitCustomizedAudioChangedDelegate__DelegateSignature
	// void BndEvt__BP_Menu_BaseSlasher_CustomizedAudio_K2Node_ComponentBoundEvent_1_OutfitCustomizedAudioChangedDelegate__DelegateSignature(FName& outfitAudioStateCollection); // [0x61c32d0] HasOutParms|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.BeginDestroySequence_Internal
	// void BeginDestroySequence_Internal();                                                                                 // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.BeginSmokeIn
	// void BeginSmokeIn();                                                                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.RestartInSequence_Internal
	// void RestartInSequence_Internal();                                                                                    // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.BndEvt__CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature
	// void BndEvt__CustomizedAudio_K2Node_ComponentBoundEvent_0_CustomizedAudioChangedDelegate__DelegateSignature(EAudioCustomizationCategory category, FString switchState); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.RemoveAssetsBeforeDestroy
	// void RemoveAssetsBeforeDestroy();                                                                                     // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.SkeletalMeshReady
	// void SkeletalMeshReady();                                                                                             // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.SetMenuAnimationState
	// void SetMenuAnimationState(TEnumAsByte<Enum_MenuAnimationState> State);                                               // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.PlayCharacterLevelUpVFX
	// void PlayCharacterLevelUpVFX();                                                                                       // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnLocalPlayerSpawned
	// void OnLocalPlayerSpawned();                                                                                          // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnGuestPlayerSpawned
	// void OnGuestPlayerSpawned(class ADBDMenuPlayer* Player);                                                              // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnLocalPlayerReadyChanged
	// void OnLocalPlayerReadyChanged(bool IsReady);                                                                         // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnAllPlayersReadyInOnlineLobby
	// void OnAllPlayersReadyInOnlineLobby();                                                                                // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnGuestPlayerDespawned
	// void OnGuestPlayerDespawned(class ADBDMenuPlayer* Player);                                                            // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnPlayerMaxPrestige
	// void OnPlayerMaxPrestige();                                                                                           // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.ExecuteUbergraph_BP_Menu_BaseSlasher
	// void ExecuteUbergraph_BP_Menu_BaseSlasher(int32_t EntryPoint);                                                        // [0x61c32d0] Final|HasDefaults    
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnMenuInterruptChange__DelegateSignature
	// void OnMenuInterruptChange__DelegateSignature(int32_t MenuInterrupt, bool DebugPassCurrentAnimation);                 // [0x61c32d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_BaseSlasher.BP_Menu_BaseSlasher_C.OnMenuAnimationStateChange__DelegateSignature
	// void OnMenuAnimationStateChange__DelegateSignature(TEnumAsByte<Enum_MenuAnimationState> State);                       // [0x61c32d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher01.BP_Menu_Slasher01_C
/// Size: 0x000F (0x000779 - 0x000788)
class ABP_Menu_Slasher01_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_01_C*                          BP_Audio_KLR_01;                                            // 0x0780   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher02.BP_Menu_Slasher02_C
/// Size: 0x000F (0x000779 - 0x000788)
class ABP_Menu_Slasher02_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_02_C*                          BP_Audio_KLR_02;                                            // 0x0780   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher02.AB_Menu_Slasher02_C
/// Size: 0x0121 (0x000300 - 0x000421)
class UAB_Menu_Slasher02_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  
	EGameFlowStep                                      CurrentMenu;                                                // 0x0420   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher02.AB_Menu_Slasher02_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher02.AB_Menu_Slasher02_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher02.AB_Menu_Slasher02_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher02.AB_Menu_Slasher02_C.ExecuteUbergraph_AB_Menu_Slasher02
	// void ExecuteUbergraph_AB_Menu_Slasher02(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher03.AB_Menu_Slasher03_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher03_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher03.AB_Menu_Slasher03_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher03.AB_Menu_Slasher03_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher03.AB_Menu_Slasher03_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher03.AB_Menu_Slasher03_C.ExecuteUbergraph_AB_Menu_Slasher03
	// void ExecuteUbergraph_AB_Menu_Slasher03(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher03.BP_Menu_Slasher03_C
/// Size: 0x001F (0x000779 - 0x000798)
class ABP_Menu_Slasher03_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_03_C*                          BP_Audio_KLR_03;                                            // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      ChainSaw01_REF;                                             // 0x0790   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher03.BP_Menu_Slasher03_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher03.BP_Menu_Slasher03_C.K03_FX_ShowChainsaw
	// void K03_FX_ShowChainsaw();                                                                                           // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher03.BP_Menu_Slasher03_C.ExecuteUbergraph_BP_Menu_Slasher03
	// void ExecuteUbergraph_BP_Menu_Slasher03(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher05.BP_Menu_Slasher05_C
/// Size: 0x000F (0x000779 - 0x000788)
class ABP_Menu_Slasher05_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_05_C*                          BP_Audio_KLR_05;                                            // 0x0780   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher05.AB_Menu_Slasher05_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher05_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher05.AB_Menu_Slasher05_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher05.AB_Menu_Slasher05_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher05.AB_Menu_Slasher05_C.ExecuteUbergraph_AB_Menu_Slasher05
	// void ExecuteUbergraph_AB_Menu_Slasher05(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale10.BP_Menu_CamperMale10_C
/// Size: 0x0009 (0x000758 - 0x000761)
class ABP_Menu_CamperMale10_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  
	bool                                               ShouldPlaySecondVoiceline;                                  // 0x0760   (0x0001)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale10.BP_Menu_CamperMale10_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale10.BP_Menu_CamperMale10_C.OnIsReadyChanged
	// void OnIsReadyChanged(bool IsReady);                                                                                  // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale10.BP_Menu_CamperMale10_C.ExecuteUbergraph_BP_Menu_CamperMale10
	// void ExecuteUbergraph_BP_Menu_CamperMale10(int32_t EntryPoint);                                                       // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Mali_Licensed/Blueprint/AB_Menu_Ash.AB_Menu_Ash_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Ash_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C
/// Size: 0x03C1 (0x000300 - 0x0006C1)
class UAB_Menu_Slasher22_Twin_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0340   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x0368   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0390   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x03B8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03E0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0460   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer3;                              // 0x0498   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult4;                                 // 0x0518   (0x0038)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer5;                              // 0x0550   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult6;                                 // 0x05D0   (0x0038)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0608   (0x00B0)  
	class ABP_Menu_BaseSlasher_C*                      BP_Menu_Base_Slasher;                                       // 0x06B8   (0x0008)  
	SDK_UNDEFINED(1,4259) /* TEnumAsByte<Enum_MenuAnimationState> */ __um(State);                                  // 0x06C0   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_11F46D534066813FD5D81A84D3491809
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_11F46D534066813FD5D81A84D3491809(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_7247E5FF42E792A9B8DA3193C6D55153
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_7247E5FF42E792A9B8DA3193C6D55153(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_2D146FA847AF3496C17155A7ECBB7A40
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_2D146FA847AF3496C17155A7ECBB7A40(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_BB5A64DA40992460A6DBC0B3596CF67E
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher22_Twin_AnimGraphNode_TransitionResult_BB5A64DA40992460A6DBC0B3596CF67E(); // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.OnMenuAnimationStateChange_Event
	// void OnMenuAnimationStateChange_Event(TEnumAsByte<Enum_MenuAnimationState> State);                                    // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22_Twin.AB_Menu_Slasher22_Twin_C.ExecuteUbergraph_AB_Menu_Slasher22_Twin
	// void ExecuteUbergraph_AB_Menu_Slasher22_Twin(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22.AB_Menu_Slasher22_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher22_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22.AB_Menu_Slasher22_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22.AB_Menu_Slasher22_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher22.AB_Menu_Slasher22_C.ExecuteUbergraph_AB_Menu_Slasher22
	// void ExecuteUbergraph_AB_Menu_Slasher22(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher22.BP_Menu_Slasher22_C
/// Size: 0x001F (0x000779 - 0x000798)
class ABP_Menu_Slasher22_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class USkeletalMeshComponent*                      _littlebrother;                                             // 0x0788   (0x0008)  
	class UBP_Audio_KLR_22_C*                          BP_Audio_KLR;                                               // 0x0790   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher22.BP_Menu_Slasher22_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher22.BP_Menu_Slasher22_C.ExecuteUbergraph_BP_Menu_Slasher22
	// void ExecuteUbergraph_BP_Menu_Slasher22(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Shortcoat_SurvivorCharmsChains.AB_S24_Shortcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_S24_Shortcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4260) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_5DDECDF843AF2545832ECBB9F33AD72B); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_5DDECDF843AF2545832ECBB9F33AD72B; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_5DDECDF843AF2545832ECBB9F33AD72B; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4261) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_5DDECDF843AF2545832ECBB9F33AD72B); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4262) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_7973EC85405B9195B9673FB1A1242D54); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_7973EC85405B9195B9673FB1A1242D54; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_7973EC85405B9195B9673FB1A1242D54; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4263) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_7973EC85405B9195B9673FB1A1242D54); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4264) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_7B8B3AE64A66B3E4FDAC58B1F55C209E); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_7B8B3AE64A66B3E4FDAC58B1F55C209E; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_7B8B3AE64A66B3E4FDAC58B1F55C209E; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4265) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_7B8B3AE64A66B3E4FDAC58B1F55C209E); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Shortcoat_SurvivorCharmsChains.AB_S24_Shortcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Shortcoat_SurvivorCharmsChains.AB_S24_Shortcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Shortcoat_SurvivorCharmsChains.AB_S24_Shortcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_S24_Shortcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_S24_Shortcoat_SurvivorCharmsChains(int32_t EntryPoint);                                      // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Highpants_SurvivorCharmsChains.AB_S24_Highpants_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_S24_Highpants_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4266) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_4F47CF384D836058B431458E6690642E); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_4F47CF384D836058B431458E6690642E; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_4F47CF384D836058B431458E6690642E; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4267) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_4F47CF384D836058B431458E6690642E); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4268) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_7DEF062F446BE1DBA7C9AE901E1DCE1E); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_7DEF062F446BE1DBA7C9AE901E1DCE1E; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_7DEF062F446BE1DBA7C9AE901E1DCE1E; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4269) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_7DEF062F446BE1DBA7C9AE901E1DCE1E); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4270) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1388219A4C9A2FECA3E2DB8E2048D4B7); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1388219A4C9A2FECA3E2DB8E2048D4B7; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1388219A4C9A2FECA3E2DB8E2048D4B7; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4271) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1388219A4C9A2FECA3E2DB8E2048D4B7); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Highpants_SurvivorCharmsChains.AB_S24_Highpants_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Highpants_SurvivorCharmsChains.AB_S24_Highpants_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Highpants_SurvivorCharmsChains.AB_S24_Highpants_SurvivorCharmsChains_C.ExecuteUbergraph_AB_S24_Highpants_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_S24_Highpants_SurvivorCharmsChains(int32_t EntryPoint);                                      // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Default_SurvivorCharmsChains.AB_S24_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_S24_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4272) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_B1F062D940F700818F5F22880B59B7C4); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_B1F062D940F700818F5F22880B59B7C4; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_B1F062D940F700818F5F22880B59B7C4; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4273) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_B1F062D940F700818F5F22880B59B7C4); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4274) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_3BF3E6DD45CAC31715D95AB372D26D9D); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_3BF3E6DD45CAC31715D95AB372D26D9D; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_3BF3E6DD45CAC31715D95AB372D26D9D; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4275) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_3BF3E6DD45CAC31715D95AB372D26D9D); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4276) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_4EDF46CB4A27B992647A659C6E978A16); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_4EDF46CB4A27B992647A659C6E978A16; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_4EDF46CB4A27B992647A659C6E978A16; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4277) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_4EDF46CB4A27B992647A659C6E978A16); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Default_SurvivorCharmsChains.AB_S24_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Default_SurvivorCharmsChains.AB_S24_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Default_SurvivorCharmsChains.AB_S24_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_S24_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_S24_Default_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Blouse_SurvivorCharmsChains.AB_S24_Blouse_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_S24_Blouse_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4278) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_4ACACEBC46CB93DE9BAC35A070AB7017); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_4ACACEBC46CB93DE9BAC35A070AB7017; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_4ACACEBC46CB93DE9BAC35A070AB7017; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4279) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_4ACACEBC46CB93DE9BAC35A070AB7017); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4280) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_C1E911434F276244A5C4DB8A8E0F6BB6); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_C1E911434F276244A5C4DB8A8E0F6BB6; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_C1E911434F276244A5C4DB8A8E0F6BB6; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4281) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_C1E911434F276244A5C4DB8A8E0F6BB6); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4282) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_40B2BB8544A2795A908790AE7C6B08C2); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_40B2BB8544A2795A908790AE7C6B08C2; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_40B2BB8544A2795A908790AE7C6B08C2; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4283) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_40B2BB8544A2795A908790AE7C6B08C2); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Blouse_SurvivorCharmsChains.AB_S24_Blouse_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Blouse_SurvivorCharmsChains.AB_S24_Blouse_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/S24/Blueprint/Charms/AB_S24_Blouse_SurvivorCharmsChains.AB_S24_Blouse_SurvivorCharmsChains_C.ExecuteUbergraph_AB_S24_Blouse_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_S24_Blouse_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale12.BP_Menu_CamperFemale12_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale12_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale12.BP_Menu_CamperFemale12_C.ExecuteUbergraph_BP_Menu_CamperFemale12
	// void ExecuteUbergraph_BP_Menu_CamperFemale12(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S24/Blueprint/AB_Menu_S24.AB_Menu_S24_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_S24_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher09.BP_Menu_Slasher09_C
/// Size: 0x001F (0x000779 - 0x000798)
class ABP_Menu_Slasher09_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_09_C*                          BP_Audio_KLR_09;                                            // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      CA_WS01_REF;                                                // 0x0790   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher09.BP_Menu_Slasher09_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher09.BP_Menu_Slasher09_C.ExecuteUbergraph_BP_Menu_Slasher09
	// void ExecuteUbergraph_BP_Menu_Slasher09(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher09.AB_Menu_Slasher09_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher09_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher09.AB_Menu_Slasher09_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher09.AB_Menu_Slasher09_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher09.AB_Menu_Slasher09_C.ExecuteUbergraph_AB_Menu_Slasher09
	// void ExecuteUbergraph_AB_Menu_Slasher09(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher23.AB_Menu_Slasher23_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher23_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher23.AB_Menu_Slasher23_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher23.AB_Menu_Slasher23_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher23.AB_Menu_Slasher23_C.ExecuteUbergraph_AB_Menu_Slasher23
	// void ExecuteUbergraph_AB_Menu_Slasher23(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher23.BP_Menu_Slasher23_C
/// Size: 0x000F (0x000779 - 0x000788)
class ABP_Menu_Slasher23_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_23_C*                          BP_Audio_KLR;                                               // 0x0780   (0x0008)  
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale13.BP_Menu_CamperFemale13_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale13_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale13.BP_Menu_CamperFemale13_C.ExecuteUbergraph_BP_Menu_CamperFemale13
	// void ExecuteUbergraph_BP_Menu_CamperFemale13(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S25/Blueprints/AB_Menu_S25.AB_Menu_S25_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_S25_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Longcoat_SurvivorCharmsChains.AB_LS_Longcoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_LS_Longcoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4284) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_36F2973D4535703A742BBEA44F1A6E04); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_36F2973D4535703A742BBEA44F1A6E04; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_36F2973D4535703A742BBEA44F1A6E04; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4285) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_36F2973D4535703A742BBEA44F1A6E04); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4286) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_46B29DCF4623E6B97EA76594355C02F6); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_46B29DCF4623E6B97EA76594355C02F6; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_46B29DCF4623E6B97EA76594355C02F6; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4287) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_46B29DCF4623E6B97EA76594355C02F6); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4288) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_20525E704052F3F0608073859FEB14B6); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_20525E704052F3F0608073859FEB14B6; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_20525E704052F3F0608073859FEB14B6; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4289) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_20525E704052F3F0608073859FEB14B6); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Longcoat_SurvivorCharmsChains.AB_LS_Longcoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Longcoat_SurvivorCharmsChains.AB_LS_Longcoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Longcoat_SurvivorCharmsChains.AB_LS_Longcoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_LS_Longcoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_LS_Longcoat_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Default_SurvivorCharmsChains.AB_LS_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_LS_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4290) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_BF6FC2324420E6EB46C93E9A8429DA33); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_BF6FC2324420E6EB46C93E9A8429DA33; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_BF6FC2324420E6EB46C93E9A8429DA33; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4291) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_BF6FC2324420E6EB46C93E9A8429DA33); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4292) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_555D0E044F3E65C177D3C9A5F1B1EDB7); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_555D0E044F3E65C177D3C9A5F1B1EDB7; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_555D0E044F3E65C177D3C9A5F1B1EDB7; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4293) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_555D0E044F3E65C177D3C9A5F1B1EDB7); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4294) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_25C950FC4233A5CF0C9E618987076312); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_25C950FC4233A5CF0C9E618987076312; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_25C950FC4233A5CF0C9E618987076312; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4295) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_25C950FC4233A5CF0C9E618987076312); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Default_SurvivorCharmsChains.AB_LS_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Default_SurvivorCharmsChains.AB_LS_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Laurie/Blueprint/Charms/AB_LS_Default_SurvivorCharmsChains.AB_LS_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_LS_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_LS_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale04.BP_Menu_CamperFemale04_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperFemale04_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Laurie/Blueprint/AB_Menu_LS.AB_Menu_LS_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_LS_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher06.BP_Menu_Slasher06_C
/// Size: 0x0017 (0x000779 - 0x000790)
class ABP_Menu_Slasher06_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_06_C*                          BP_Audio_KLR_06;                                            // 0x0780   (0x0008)  
	class UDBDPlayerPositionOffsetComponent*           DBDPlayerPositionOffset;                                    // 0x0788   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher06.AB_Menu_Slasher06_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher06_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher06.AB_Menu_Slasher06_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher06.AB_Menu_Slasher06_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher06.AB_Menu_Slasher06_C.ExecuteUbergraph_AB_Menu_Slasher06
	// void ExecuteUbergraph_AB_Menu_Slasher06(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale05.BP_Menu_CamperFemale05_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale05_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale05.BP_Menu_CamperFemale05_C.ExecuteUbergraph_BP_Menu_CamperFemale05
	// void ExecuteUbergraph_BP_Menu_CamperFemale05(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Feng/Blueprint/AB_Menu_FM.AB_Menu_FM_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_FM_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/Feng/Blueprint/AB_Menu_FM.AB_Menu_FM_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Feng/Blueprint/AB_Menu_FM.AB_Menu_FM_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Feng/Blueprint/AB_Menu_FM.AB_Menu_FM_C.ExecuteUbergraph_AB_Menu_FM
	// void ExecuteUbergraph_AB_Menu_FM(int32_t EntryPoint);                                                                 // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher07.BP_Menu_Slasher07_C
/// Size: 0x0017 (0x000779 - 0x000790)
class ABP_Menu_Slasher07_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_07_C*                          BP_Audio_KLR_07;                                            // 0x0780   (0x0008)  
	class UDBDPlayerPositionOffsetComponent*           DBDPlayerPositionOffset;                                    // 0x0788   (0x0008)  
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher07.AB_Menu_Slasher07_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher07_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher07.AB_Menu_Slasher07_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher07.AB_Menu_Slasher07_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher07.AB_Menu_Slasher07_C.ExecuteUbergraph_AB_Menu_Slasher07
	// void ExecuteUbergraph_AB_Menu_Slasher07(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C
/// Size: 0x0030 (0x000779 - 0x0007A9)
class ABP_Menu_Slasher08_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_08_C*                          BP_Audio_KLR_08;                                            // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      ItemMesh_Axe;                                               // 0x0790   (0x0008)  
	float                                              Timeline_1_Dissolve_01C466A74EFEFADB8976FC84BC95D44F;       // 0x0798   (0x0004)  
	SDK_UNDEFINED(1,4296) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_1__Direction_01C466A74EFEFADB8976FC84BC95D44F); // 0x079C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x079D   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x07A0   (0x0008)  
	bool                                               IsHatchetVisible;                                           // 0x07A8   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.Timeline_1__FinishedFunc
	// void Timeline_1__FinishedFunc();                                                                                      // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.Timeline_1__UpdateFunc
	// void Timeline_1__UpdateFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.FX_MakeHatchetAppear
	// void FX_MakeHatchetAppear();                                                                                          // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.FX_MakeHatchetDisappear
	// void FX_MakeHatchetDisappear();                                                                                       // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.OnCustomizationUpdated
	// void OnCustomizationUpdated();                                                                                        // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.K08_FX_MakeHatchetAppear
	// void K08_FX_MakeHatchetAppear();                                                                                      // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.K08_FX_MakeHatchetDisappear
	// void K08_FX_MakeHatchetDisappear();                                                                                   // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher08.BP_Menu_Slasher08_C.ExecuteUbergraph_BP_Menu_Slasher08
	// void ExecuteUbergraph_BP_Menu_Slasher08(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher08_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.GetKiller
	// void GetKiller(TScriptInterface<BlueprintGeneratedClass>& Menu Slasher 08);                                           // [0x61c32d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.AnimNotify_FX_MakeHatchetAppear
	// void AnimNotify_FX_MakeHatchetAppear();                                                                               // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.AnimNotify_FX_MakeHatchetDisappear
	// void AnimNotify_FX_MakeHatchetDisappear();                                                                            // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher08.AB_Menu_Slasher08_C.ExecuteUbergraph_AB_Menu_Slasher08
	// void ExecuteUbergraph_AB_Menu_Slasher08(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale05.BP_Menu_CamperMale05_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale05_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/David/Blueprint/AB_Menu_David.AB_Menu_David_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_David_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/David/Blueprint/AB_Menu_David.AB_Menu_David_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/David/Blueprint/AB_Menu_David.AB_Menu_David_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/David/Blueprint/AB_Menu_David.AB_Menu_David_C.ExecuteUbergraph_AB_Menu_David
	// void ExecuteUbergraph_AB_Menu_David(int32_t EntryPoint);                                                              // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/K24/Weapons/Blueprints/AB_K24_SW00_Menu.AB_K24_SW00_Menu_C
/// Size: 0x00A8 (0x0002C0 - 0x000368)
class UAB_K24_SW00_Menu_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x0300   (0x0018)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0318   (0x0050)  


	/// Functions
	// Function /Game/Characters/Slashers/K24/Weapons/Blueprints/AB_K24_SW00_Menu.AB_K24_SW00_Menu_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/K24/Weapons/Blueprints/AB_K24_SW00_Menu.AB_K24_SW00_Menu_C.ExecuteUbergraph_AB_K24_SW00_Menu
	// void ExecuteUbergraph_AB_K24_SW00_Menu(int32_t EntryPoint);                                                           // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher24.AB_Menu_Slasher24_C
/// Size: 0x0130 (0x000300 - 0x000430)
class UAB_Menu_Slasher24_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FVector                                            __CustomProperty_ScaleInLobby_45F7183343C3638857E8E19E90ABFF6E; // 0x03E8   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x03F4   (0x0004)  MISSED
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03F8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher24.AB_Menu_Slasher24_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher24.AB_Menu_Slasher24_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher24.AB_Menu_Slasher24_C.ExecuteUbergraph_AB_Menu_Slasher24
	// void ExecuteUbergraph_AB_Menu_Slasher24(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C
/// Size: 0x0027 (0x000779 - 0x0007A0)
class ABP_Menu_Slasher24_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UK24_KillerAudioMenuReaction_C*              K24_KillerAudioMenuReaction;                                // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      _tentacle;                                                  // 0x0790   (0x0008)  
	class UBP_Audio_KLR_24_C*                          BP_Audio_KLR;                                               // 0x0798   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnNotifyEnd_699133144A8A4CBB65233EA538E5F3E6
	// void OnNotifyEnd_699133144A8A4CBB65233EA538E5F3E6(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnNotifyBegin_699133144A8A4CBB65233EA538E5F3E6
	// void OnNotifyBegin_699133144A8A4CBB65233EA538E5F3E6(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnInterrupted_699133144A8A4CBB65233EA538E5F3E6
	// void OnInterrupted_699133144A8A4CBB65233EA538E5F3E6(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnBlendOut_699133144A8A4CBB65233EA538E5F3E6
	// void OnBlendOut_699133144A8A4CBB65233EA538E5F3E6(FName NotifyName);                                                   // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.OnCompleted_699133144A8A4CBB65233EA538E5F3E6
	// void OnCompleted_699133144A8A4CBB65233EA538E5F3E6(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.K24_FX_ShowTentacle
	// void K24_FX_ShowTentacle();                                                                                           // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.K24_FX_HideTentacle
	// void K24_FX_HideTentacle();                                                                                           // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.SetMenuAnimationState
	// void SetMenuAnimationState(TEnumAsByte<Enum_MenuAnimationState> State);                                               // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher24.BP_Menu_Slasher24_C.ExecuteUbergraph_BP_Menu_Slasher24
	// void ExecuteUbergraph_BP_Menu_Slasher24(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S26/Blueprints/AB_Menu_S26.AB_Menu_S26_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_S26_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale14.BP_Menu_CamperFemale14_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale14_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale14.BP_Menu_CamperFemale14_C.ExecuteUbergraph_BP_Menu_CamperFemale14
	// void ExecuteUbergraph_BP_Menu_CamperFemale14(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale13.BP_Menu_CamperMale13_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperMale13_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale13.BP_Menu_CamperMale13_C.ExecuteUbergraph_BP_Menu_CamperMale13
	// void ExecuteUbergraph_BP_Menu_CamperMale13(int32_t EntryPoint);                                                       // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/S27/Blueprints/AB_Menu_S27.AB_Menu_S27_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_S27_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher10.AB_Menu_Slasher10_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher10_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher10.AB_Menu_Slasher10_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher10.AB_Menu_Slasher10_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher10.AB_Menu_Slasher10_C.ExecuteUbergraph_AB_Menu_Slasher10
	// void ExecuteUbergraph_AB_Menu_Slasher10(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher10.BP_Menu_Slasher10_C
/// Size: 0x0017 (0x000779 - 0x000790)
class ABP_Menu_Slasher10_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_10_C*                          BP_Audio_KLR;                                               // 0x0788   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher10.BP_Menu_Slasher10_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher10.BP_Menu_Slasher10_C.ExecuteUbergraph_BP_Menu_Slasher10
	// void ExecuteUbergraph_BP_Menu_Slasher10(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale06.BP_Menu_CamperMale06_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale06_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Quentin/Blueprint/AB_Menu_Quentin.AB_Menu_Quentin_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Quentin_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher11.AB_Menu_Slasher11_C
/// Size: 0x0120 (0x000300 - 0x000420)
class UAB_Menu_Slasher11_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03E8   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher11.AB_Menu_Slasher11_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher11.AB_Menu_Slasher11_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher11.AB_Menu_Slasher11_C.ExecuteUbergraph_AB_Menu_Slasher11
	// void ExecuteUbergraph_AB_Menu_Slasher11(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher11.BP_Menu_Slasher11_C
/// Size: 0x001F (0x000779 - 0x000798)
class ABP_Menu_Slasher11_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_11_C*                          BP_Audio_KLR;                                               // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      RBT_Mesh;                                                   // 0x0790   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher11.BP_Menu_Slasher11_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher11.BP_Menu_Slasher11_C.ExecuteUbergraph_BP_Menu_Slasher11
	// void ExecuteUbergraph_BP_Menu_Slasher11(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Longcoat_SurvivorCharmChain.AB_FS_Longcoat_SurvivorCharmChain_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_FS_Longcoat_SurvivorCharmChain_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4297) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_CE190CD74689A1589AC307A4E06BEC76); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_CE190CD74689A1589AC307A4E06BEC76; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_CE190CD74689A1589AC307A4E06BEC76; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4298) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_CE190CD74689A1589AC307A4E06BEC76); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4299) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_0BA1344D4323847BA9433A9DA771E27B); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_0BA1344D4323847BA9433A9DA771E27B; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_0BA1344D4323847BA9433A9DA771E27B; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4300) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_0BA1344D4323847BA9433A9DA771E27B); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4301) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_179FF0D540A8637E265D36BBBB36E10B); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_179FF0D540A8637E265D36BBBB36E10B; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_179FF0D540A8637E265D36BBBB36E10B; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4302) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_179FF0D540A8637E265D36BBBB36E10B); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Longcoat_SurvivorCharmChain.AB_FS_Longcoat_SurvivorCharmChain_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Longcoat_SurvivorCharmChain.AB_FS_Longcoat_SurvivorCharmChain_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Longcoat_SurvivorCharmChain.AB_FS_Longcoat_SurvivorCharmChain_C.ExecuteUbergraph_AB_FS_Longcoat_SurvivorCharmChain
	// void ExecuteUbergraph_AB_FS_Longcoat_SurvivorCharmChain(int32_t EntryPoint);                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Default_SurvivorCharmsChains.AB_FS_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_FS_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4303) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_C1DC51DF4AC1703C65954CA263C4EE16); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_C1DC51DF4AC1703C65954CA263C4EE16; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_C1DC51DF4AC1703C65954CA263C4EE16; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4304) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_C1DC51DF4AC1703C65954CA263C4EE16); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4305) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_088924E94E443CAE14895CA344EA0141); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_088924E94E443CAE14895CA344EA0141; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_088924E94E443CAE14895CA344EA0141; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4306) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_088924E94E443CAE14895CA344EA0141); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4307) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_D84FAFC14BC6ED673107918EDBBFCD1D); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_D84FAFC14BC6ED673107918EDBBFCD1D; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_D84FAFC14BC6ED673107918EDBBFCD1D; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4308) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_D84FAFC14BC6ED673107918EDBBFCD1D); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Default_SurvivorCharmsChains.AB_FS_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Default_SurvivorCharmsChains.AB_FS_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/Charms/AB_FS_Default_SurvivorCharmsChains.AB_FS_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_FS_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_FS_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperMale07.BP_Menu_CamperMale07_C
/// Size: 0x0000 (0x000758 - 0x000758)
class ABP_Menu_CamperMale07_C : public ABP_Menu_Base_Camper_C
{ 
public:
};

/// Class /Game/Characters/Campers/Finland/Blueprint/AB_Menu_Tap.AB_Menu_Tap_C
/// Size: 0x0140 (0x0002C0 - 0x000400)
class UAB_Menu_Tap_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0300   (0x00A8)  
	FAset_Camper_Menu                                  MenuAnimSet;                                                // 0x03A8   (0x0058)  


	/// Functions
	// Function /Game/Characters/Campers/Finland/Blueprint/AB_Menu_Tap.AB_Menu_Tap_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/AB_Menu_Tap.AB_Menu_Tap_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Finland/Blueprint/AB_Menu_Tap.AB_Menu_Tap_C.ExecuteUbergraph_AB_Menu_Tap
	// void ExecuteUbergraph_AB_Menu_Tap(int32_t EntryPoint);                                                                // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C
/// Size: 0x0037 (0x000779 - 0x0007B0)
class ABP_Menu_Slasher25_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class USkeletalMeshComponent*                      LamentConfMesh;                                             // 0x0788   (0x0008)  
	class USkeletalMeshComponent*                      ChainsMesh;                                                 // 0x0790   (0x0008)  
	class UBP_Audio_KLR_25_C*                          BP_Audio_KLR;                                               // 0x0798   (0x0008)  
	float                                              TM_LamentBoxVisibility_Dissolve_A56755B4431C0BE684B0688D2A09C847; // 0x07A0   (0x0004)  
	SDK_UNDEFINED(1,4309) /* TEnumAsByte<ETimelineDirection> */ __um(TM_LamentBoxVisibility__Direction_A56755B4431C0BE684B0688D2A09C847); // 0x07A4   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x07A5   (0x0003)  MISSED
	class UTimelineComponent*                          TM_LamentBoxVisibility;                                     // 0x07A8   (0x0008)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.TM_LamentBoxVisibility__FinishedFunc
	// void TM_LamentBoxVisibility__FinishedFunc();                                                                          // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.TM_LamentBoxVisibility__UpdateFunc
	// void TM_LamentBoxVisibility__UpdateFunc();                                                                            // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.MakeLamentBoxAppear
	// void MakeLamentBoxAppear();                                                                                           // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.MakeLamentBoxDisappear
	// void MakeLamentBoxDisappear();                                                                                        // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher25.BP_Menu_Slasher25_C.ExecuteUbergraph_BP_Menu_Slasher25
	// void ExecuteUbergraph_BP_Menu_Slasher25(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/K25/Weapons/Blueprints/AB_K25_SW00_REF.AB_K25_SW00_REF_C
/// Size: 0x00A9 (0x0002C0 - 0x000369)
class UAB_K25_SW00_REF_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0300   (0x0050)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x0350   (0x0018)  
	bool                                               _interupt;                                                  // 0x0368   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/K25/Weapons/Blueprints/AB_K25_SW00_REF.AB_K25_SW00_REF_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/K25/Weapons/Blueprints/AB_K25_SW00_REF.AB_K25_SW00_REF_C.ExecuteUbergraph_AB_K25_SW00_REF
	// void ExecuteUbergraph_AB_K25_SW00_REF(int32_t EntryPoint);                                                            // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C
/// Size: 0x0128 (0x000300 - 0x000428)
class UAB_Menu_Slasher25_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	class ABP_Menu_Slasher25_C*                        KillerBP;                                                   // 0x03E8   (0x0008)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x03F0   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_510336D14A5EC834C02539AA7C83A35B
	// void OnNotifyEnd_510336D14A5EC834C02539AA7C83A35B(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_510336D14A5EC834C02539AA7C83A35B
	// void OnNotifyBegin_510336D14A5EC834C02539AA7C83A35B(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_510336D14A5EC834C02539AA7C83A35B
	// void OnInterrupted_510336D14A5EC834C02539AA7C83A35B(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_510336D14A5EC834C02539AA7C83A35B
	// void OnBlendOut_510336D14A5EC834C02539AA7C83A35B(FName NotifyName);                                                   // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_510336D14A5EC834C02539AA7C83A35B
	// void OnCompleted_510336D14A5EC834C02539AA7C83A35B(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_7A83B53B4483DAD7327526A33721EE7A
	// void OnNotifyEnd_7A83B53B4483DAD7327526A33721EE7A(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_7A83B53B4483DAD7327526A33721EE7A
	// void OnNotifyBegin_7A83B53B4483DAD7327526A33721EE7A(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_7A83B53B4483DAD7327526A33721EE7A
	// void OnInterrupted_7A83B53B4483DAD7327526A33721EE7A(FName NotifyName);                                                // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_7A83B53B4483DAD7327526A33721EE7A
	// void OnBlendOut_7A83B53B4483DAD7327526A33721EE7A(FName NotifyName);                                                   // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_7A83B53B4483DAD7327526A33721EE7A
	// void OnCompleted_7A83B53B4483DAD7327526A33721EE7A(FName NotifyName);                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_FX_K25_Menu_DisappearBox
	// void AnimNotify_FX_K25_Menu_DisappearBox();                                                                           // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                  // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnMenuAnimationStateChange_Event
	// void OnMenuAnimationStateChange_Event(TEnumAsByte<Enum_MenuAnimationState> State);                                    // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_FX_K25_Menu_AppearBox
	// void AnimNotify_FX_K25_Menu_AppearBox();                                                                              // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher25.AB_Menu_Slasher25_C.ExecuteUbergraph_AB_Menu_Slasher25
	// void ExecuteUbergraph_AB_Menu_Slasher25(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher12.AB_Menu_Slasher12_C
/// Size: 0x0298 (0x000300 - 0x000598)
class UAB_Menu_Slasher12_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x03E8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0408   (0x0020)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x0428   (0x0138)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x0560   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher12.AB_Menu_Slasher12_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher12.AB_Menu_Slasher12_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher12.AB_Menu_Slasher12_C.ExecuteUbergraph_AB_Menu_Slasher12
	// void ExecuteUbergraph_AB_Menu_Slasher12(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher12.BP_Menu_Slasher12_C
/// Size: 0x0017 (0x000779 - 0x000790)
class ABP_Menu_Slasher12_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	class UBP_Audio_KLR_12_C*                          BP_Audio_KLR;                                               // 0x0780   (0x0008)  
	class UArrowComponent*                             Arrow1;                                                     // 0x0788   (0x0008)  
};

/// Class /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_LongCoat_SurvivorCharmsChains.AB_GS_LongCoat_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_GS_LongCoat_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4310) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_1593CC7E42A76942293EE4AB725A0D2E); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_1593CC7E42A76942293EE4AB725A0D2E; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_1593CC7E42A76942293EE4AB725A0D2E; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4311) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_1593CC7E42A76942293EE4AB725A0D2E); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4312) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_EC0938544EB9191FF23E9B81697A1518); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_EC0938544EB9191FF23E9B81697A1518; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_EC0938544EB9191FF23E9B81697A1518; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4313) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_EC0938544EB9191FF23E9B81697A1518); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4314) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_48E666A444774048903151A4A88D7386); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_48E666A444774048903151A4A88D7386; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_48E666A444774048903151A4A88D7386; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4315) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_48E666A444774048903151A4A88D7386); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_LongCoat_SurvivorCharmsChains.AB_GS_LongCoat_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_LongCoat_SurvivorCharmsChains.AB_GS_LongCoat_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_LongCoat_SurvivorCharmsChains.AB_GS_LongCoat_SurvivorCharmsChains_C.ExecuteUbergraph_AB_GS_LongCoat_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_GS_LongCoat_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Historia_SurvivorCharmsChains.AB_GS_Historia_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_GS_Historia_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4316) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_E0AEF4944D4BA49CF5C4F08B764FFE63); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_E0AEF4944D4BA49CF5C4F08B764FFE63; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_E0AEF4944D4BA49CF5C4F08B764FFE63; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4317) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_E0AEF4944D4BA49CF5C4F08B764FFE63); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4318) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_4DB9EB2F4B196CD45BD209AED35D9B1B); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_4DB9EB2F4B196CD45BD209AED35D9B1B; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_4DB9EB2F4B196CD45BD209AED35D9B1B; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4319) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_4DB9EB2F4B196CD45BD209AED35D9B1B); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4320) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_30E9DC9644CCF6B8E6F6BF93717576DB); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_30E9DC9644CCF6B8E6F6BF93717576DB; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_30E9DC9644CCF6B8E6F6BF93717576DB; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4321) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_30E9DC9644CCF6B8E6F6BF93717576DB); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Historia_SurvivorCharmsChains.AB_GS_Historia_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Historia_SurvivorCharmsChains.AB_GS_Historia_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Historia_SurvivorCharmsChains.AB_GS_Historia_SurvivorCharmsChains_C.ExecuteUbergraph_AB_GS_Historia_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_GS_Historia_SurvivorCharmsChains(int32_t EntryPoint);                                        // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Default_SurvivorCharmsChains.AB_GS_Default_SurvivorCharmsChains_C
/// Size: 0x0478 (0x0002C0 - 0x000738)
class UAB_GS_Default_SurvivorCharmsChains_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0038)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0300   (0x01D8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x04D8   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph0;                             // 0x0580   (0x00A8)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph1;                             // 0x0628   (0x00A8)  
	SDK_UNDEFINED(1,4322) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_67A110EF4A9EAA1AB1643584E398E0AA); // 0x06D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x06D1   (0x0003)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_67A110EF4A9EAA1AB1643584E398E0AA; // 0x06D4   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_67A110EF4A9EAA1AB1643584E398E0AA; // 0x06E0   (0x000C)  
	SDK_UNDEFINED(1,4323) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_67A110EF4A9EAA1AB1643584E398E0AA); // 0x06EC   (0x0001)  
	SDK_UNDEFINED(1,4324) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_B9617A3B42D99541DFABF2901217577B); // 0x06ED   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EE   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_B9617A3B42D99541DFABF2901217577B; // 0x06F0   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_B9617A3B42D99541DFABF2901217577B; // 0x06FC   (0x000C)  
	SDK_UNDEFINED(1,4325) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_B9617A3B42D99541DFABF2901217577B); // 0x0708   (0x0001)  
	SDK_UNDEFINED(1,4326) /* TEnumAsByte<Enum_CharmsJointChains> */ __um(__CustomProperty_JointChain_E0E374164E7C01098E98938C4AC753A7); // 0x0709   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x070A   (0x0002)  MISSED
	FRotator                                           __CustomProperty_RotationOffset_E0E374164E7C01098E98938C4AC753A7; // 0x070C   (0x000C)  
	FVector                                            __CustomProperty_TranslationOffset_E0E374164E7C01098E98938C4AC753A7; // 0x0718   (0x000C)  
	SDK_UNDEFINED(1,4327) /* TEnumAsByte<Enum_CharmsJointAttachment> */ __um(__CustomProperty_ConstraintParent_E0E374164E7C01098E98938C4AC753A7); // 0x0724   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0725   (0x0003)  MISSED
	class ACharmAttacher*                              CharmAttacher;                                              // 0x0728   (0x0008)  
	class USkeletalMeshComponent*                      OwningSkeletalMesh;                                         // 0x0730   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Default_SurvivorCharmsChains.AB_GS_Default_SurvivorCharmsChains_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Default_SurvivorCharmsChains.AB_GS_Default_SurvivorCharmsChains_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Campers/Guam/Blueprint/Charms/AB_GS_Default_SurvivorCharmsChains.AB_GS_Default_SurvivorCharmsChains_C.ExecuteUbergraph_AB_GS_Default_SurvivorCharmsChains
	// void ExecuteUbergraph_AB_GS_Default_SurvivorCharmsChains(int32_t EntryPoint);                                         // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale06.BP_Menu_CamperFemale06_C
/// Size: 0x0008 (0x000758 - 0x000760)
class ABP_Menu_CamperFemale06_C : public ABP_Menu_Base_Camper_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0758   (0x0008)  


	/// Functions
	// Function /Game/Characters/Campers/Blueprints/Menu/BP_Menu_CamperFemale06.BP_Menu_CamperFemale06_C.ExecuteUbergraph_BP_Menu_CamperFemale06
	// void ExecuteUbergraph_BP_Menu_CamperFemale06(int32_t EntryPoint);                                                     // [0x61c32d0] Final                
};

/// Class /Game/Characters/Campers/Guam/Blueprint/AB_Menu_Kate.AB_Menu_Kate_C
/// Size: 0x0000 (0x001B18 - 0x001B18)
class UAB_Menu_Kate_C : public UAB_Menu_Camper_C
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/BP_RedStainComponent.BP_RedStainComponent_C
/// Size: 0x0000 (0x000440 - 0x000440)
class UBP_RedStainComponent_C : public URedStainComponent
{ 
public:
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C
/// Size: 0x3858 (0x000300 - 0x003B58)
class UAB_Menu_Slasher13_C : public UBaseMenuAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0038)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x0340   (0x00A8)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x03E8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x03F0   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics0;                                // 0x0850   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics1;                                // 0x0CB0   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics2;                                // 0x1110   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics3;                                // 0x1570   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics4;                                // 0x19D0   (0x0460)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x1E30   (0x0138)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone5;                                  // 0x1F68   (0x0138)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics6;                                // 0x20A0   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics7;                                // 0x2500   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics8;                                // 0x2960   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics9;                                // 0x2DC0   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics10;                               // 0x3220   (0x0460)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics11;                               // 0x3680   (0x0460)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x3AE0   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x3B00   (0x0020)  
	FAset_Slasher_Menu                                 MenuAnimSet;                                                // 0x3B20   (0x0038)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x61c32d0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                      // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.AnimNotify_FX_HK_MenuInt_MakeWeaponAppear
	// void AnimNotify_FX_HK_MenuInt_MakeWeaponAppear();                                                                     // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.AnimNotify_FX_HK_MenuInt_MakeWeaponDisappear
	// void AnimNotify_FX_HK_MenuInt_MakeWeaponDisappear();                                                                  // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.AnimNotify_FX_HK_MenuBack_MakeSwordVisible
	// void AnimNotify_FX_HK_MenuBack_MakeSwordVisible();                                                                    // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.AnimNotify_FX_HK_Menu_MakeSwordInvisible
	// void AnimNotify_FX_HK_Menu_MakeSwordInvisible();                                                                      // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.BlueprintLinkedAnimationLayersInitialized
	// void BlueprintLinkedAnimationLayersInitialized();                                                                     // [0x61c32d0] Event|Public|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/AB_Menu_Slasher13.AB_Menu_Slasher13_C.ExecuteUbergraph_AB_Menu_Slasher13
	// void ExecuteUbergraph_AB_Menu_Slasher13(int32_t EntryPoint);                                                          // [0x61c32d0] Final                
};

/// Class /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C
/// Size: 0x0090 (0x000779 - 0x000809)
class ABP_Menu_Slasher13_C : public ABP_Menu_BaseSlasher_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0779   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0780   (0x0008)  
	class UBP_Audio_KLR_13_C*                          BP_Audio_KLR;                                               // 0x0788   (0x0008)  
	class UBP_RedStainComponent_C*                     RedStainComponent;                                          // 0x0790   (0x0008)  
	float                                              Show_Sword_WPO_964716F24F8255A0C9F98FA0967E8ECF;            // 0x0798   (0x0004)  
	float                                              Show_Sword_Shard_Disappear_964716F24F8255A0C9F98FA0967E8ECF; // 0x079C   (0x0004)  
	float                                              Show_Sword_Sword_Appear_964716F24F8255A0C9F98FA0967E8ECF;   // 0x07A0   (0x0004)  
	SDK_UNDEFINED(1,4328) /* TEnumAsByte<ETimelineDirection> */ __um(Show_Sword__Direction_964716F24F8255A0C9F98FA0967E8ECF); // 0x07A4   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x07A5   (0x0003)  MISSED
	class UTimelineComponent*                          Show_Sword;                                                 // 0x07A8   (0x0008)  
	FVector                                            Timeline_2_Size_548F5340441650D05914669F2F45DC7E;           // 0x07B0   (0x000C)  
	FVector                                            Timeline_2_Particle_Location_548F5340441650D05914669F2F45DC7E; // 0x07BC   (0x000C)  
	SDK_UNDEFINED(1,4329) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_2__Direction_548F5340441650D05914669F2F45DC7E); // 0x07C8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x07C9   (0x0007)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x07D0   (0x0008)  
	FVector                                            Make_Sword_Disappear_Shard_Size_E08D4B9E409A9213BEBDBD84EE0E3709; // 0x07D8   (0x000C)  
	FVector                                            Make_Sword_Disappear_Particle_Position_E08D4B9E409A9213BEBDBD84EE0E3709; // 0x07E4   (0x000C)  
	float                                              Make_Sword_Disappear_WPO_E08D4B9E409A9213BEBDBD84EE0E3709;  // 0x07F0   (0x0004)  
	float                                              Make_Sword_Disappear_Shard_Appear_E08D4B9E409A9213BEBDBD84EE0E3709; // 0x07F4   (0x0004)  
	float                                              Make_Sword_Disappear_Weapon_Disappear_E08D4B9E409A9213BEBDBD84EE0E3709; // 0x07F8   (0x0004)  
	SDK_UNDEFINED(1,4330) /* TEnumAsByte<ETimelineDirection> */ __um(Make_Sword_Disappear__Direction_E08D4B9E409A9213BEBDBD84EE0E3709); // 0x07FC   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x07FD   (0x0003)  MISSED
	class UTimelineComponent*                          Make_Sword_Disappear;                                       // 0x0800   (0x0008)  
	bool                                               SwordShouldBeVisible;                                       // 0x0808   (0x0001)  


	/// Functions
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.GetShard
	// void GetShard(class USkeletalMeshComponent*& Shard);                                                                  // [0x61c32d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.GetSword
	// void GetSword(class USkeletalMeshComponent*& Sword);                                                                  // [0x61c32d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Make Sword Disappear__FinishedFunc
	// void Make Sword Disappear__FinishedFunc();                                                                            // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Make Sword Disappear__UpdateFunc
	// void Make Sword Disappear__UpdateFunc();                                                                              // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Show Sword__FinishedFunc
	// void Show Sword__FinishedFunc();                                                                                      // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Show Sword__UpdateFunc
	// void Show Sword__UpdateFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Timeline_2__FinishedFunc
	// void Timeline_2__FinishedFunc();                                                                                      // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.Timeline_2__UpdateFunc
	// void Timeline_2__UpdateFunc();                                                                                        // [0x61c32d0] BlueprintEvent       
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x61c32d0] Event|Protected|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.OnCustomizationUpdated
	// void OnCustomizationUpdated();                                                                                        // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.OnAttack_StopTimeline
	// void OnAttack_StopTimeline();                                                                                         // [0x61c32d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Slashers/Blueprints/Menu/BP_Menu_Slasher13.BP_Menu_Slasher13_C.K13_FX_MakeSwordInvisible
	// void K13_FX_MakeSwordInvisible();                                                                                     // [0x61c32d0] Public|BlueprintCallable|BlueprintEvent 
