
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: DBDUIViewsCore
/// dependency: Engine
/// dependency: UMG

/// Class /DBDUICore/Watermark/WBP_CoreWatermark.WBP_CoreWatermark_C
/// Size: 0x0068 (0x000350 - 0x0003B8)
class UWBP_CoreWatermark_C : public UCoreWatermarkWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	class UCanvasPanel*                                CanvasPanel;                                                // 0x0358   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText1;                                          // 0x0360   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText10;                                         // 0x0368   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText11;                                         // 0x0370   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText2;                                          // 0x0378   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText3;                                          // 0x0380   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText4;                                          // 0x0388   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText5;                                          // 0x0390   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText6;                                          // 0x0398   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText7;                                          // 0x03A0   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText8;                                          // 0x03A8   (0x0008)  
	class UDBDTextBlock*                               WatermarkDBDText9;                                          // 0x03B0   (0x0008)  


	/// Functions
	// Function /DBDUICore/Watermark/WBP_CoreWatermark.WBP_CoreWatermark_C.Construct
	// void Construct();                                                                                                     // [0x61d2f50] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /DBDUICore/Watermark/WBP_CoreWatermark.WBP_CoreWatermark_C.ExecuteUbergraph_WBP_CoreWatermark
	// void ExecuteUbergraph_WBP_CoreWatermark(int32_t EntryPoint);                                                          // [0x61d2f50] Final|HasDefaults    
};

